{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": [],
      "collapsed_sections": [],
      "authorship_tag": "ABX9TyMefHzRhNF4nr9Okf3n0Ql+",
      "include_colab_link": true
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "view-in-github",
        "colab_type": "text"
      },
      "source": [
        "<a href=\"https://colab.research.google.com/github/momo54/large_scale_data_management/blob/main/VoiD_with_PySpark_RDD.ipynb\" target=\"_parent\"><img src=\"https://colab.research.google.com/assets/colab-badge.svg\" alt=\"Open In Colab\"/></a>"
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "\n",
        "\n",
        "# Installing SPARK for Playing\n"
      ],
      "metadata": {
        "id": "rA7z32t7e1-U"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "!pip install pyspark"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "O-trb2SQbXlG",
        "outputId": "f202c8ea-f182-439f-bfbe-8d978d7be8e7"
      },
      "execution_count": 23,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/\n",
            "Requirement already satisfied: pyspark in /usr/local/lib/python3.7/dist-packages (3.3.0)\n",
            "Requirement already satisfied: py4j==0.10.9.5 in /usr/local/lib/python3.7/dist-packages (from pyspark) (0.10.9.5)\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "!pip install -q findspark\n",
        "import findspark\n",
        "findspark.init()\n"
      ],
      "metadata": {
        "id": "hXxKUhrWbqeo"
      },
      "execution_count": 24,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "# SPARK Installed... Start playing"
      ],
      "metadata": {
        "id": "0cUONB2qekaq"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "from pyspark.sql import SparkSession\n",
        "spark = SparkSession.builder\\\n",
        "        .master(\"local\")\\\n",
        "        .appName(\"Colab\")\\\n",
        "        .config('spark.ui.port', '4050')\\\n",
        "        .getOrCreate()"
      ],
      "metadata": {
        "id": "nIOiyuKYbwpD"
      },
      "execution_count": 25,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "!wget -q https://storage.googleapis.com/public_lddm_data/small_page_links.nt\n",
        "!ls\n",
        "!wget -q \"https://data.dws.informatik.uni-mannheim.de/structureddata/2021-12/quads/classspecific/schema_Mountain/part_0.gz\"\n",
        "!ls"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "l3hT1MN1cLUX",
        "outputId": "a88b7e6f-bcf5-4b4a-8244-1715fe35765a"
      },
      "execution_count": 26,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "part_0.gz    sample_data\t  small_page_links.nt.1\n",
            "part_0.gz.1  small_page_links.nt  small_page_links.nt.2\n",
            "part_0.gz    part_0.gz.2  small_page_links.nt\t small_page_links.nt.2\n",
            "part_0.gz.1  sample_data  small_page_links.nt.1\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "lines = spark.read.text(\"part_0.gz\").rdd.map(lambda r: r[0])\n",
        "\n"
      ],
      "metadata": {
        "id": "ipEyiQNgddZt"
      },
      "execution_count": 27,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "lines.take(5)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "t2m1GJP-djds",
        "outputId": "12986f10-c10b-4ddf-abc6-591dca6d63cf"
      },
      "execution_count": 28,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "['_:nb53a24408607424384c1357880ce1bc7xb0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://schema.org/Mountain> <https://peakery.com/dragontail-peak-washington/>   .',\n",
              " '_:nb53a24408607424384c1357880ce1bc7xb0 <http://schema.org/additionalProperty> _:nb53a24408607424384c1357880ce1bc7xb1 <https://peakery.com/dragontail-peak-washington/>   .',\n",
              " '_:nb53a24408607424384c1357880ce1bc7xb0 <http://schema.org/additionalProperty> _:nb53a24408607424384c1357880ce1bc7xb2 <https://peakery.com/dragontail-peak-washington/>   .',\n",
              " '_:nb53a24408607424384c1357880ce1bc7xb0 <http://schema.org/additionalProperty> _:nb53a24408607424384c1357880ce1bc7xb3 <https://peakery.com/dragontail-peak-washington/>   .',\n",
              " '_:nb53a24408607424384c1357880ce1bc7xb0 <http://schema.org/additionalProperty> _:nb53a24408607424384c1357880ce1bc7xb4 <https://peakery.com/dragontail-peak-washington/>   .']"
            ]
          },
          "metadata": {},
          "execution_count": 28
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "lines.count()"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "98abFy-tdpV9",
        "outputId": "9245f9d2-f606-4900-84c2-af6407c401d9"
      },
      "execution_count": 29,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "2113514"
            ]
          },
          "metadata": {},
          "execution_count": 29
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "import re\n",
        "def parseTriple(line) :\n",
        "    \"\"\"Parses a urls pair string into urls pair.\"\"\"\n",
        "    parts = re.split(r'\\s+', line)\n",
        "    return parts[0], parts[1], parts[2],parts[3]\n",
        "triples=lines.map(lambda x:parseTriple(x))\n",
        "print(triples.count())\n",
        "triples.take(1)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "OL8aSA_GjSQJ",
        "outputId": "ed4ea2e3-294f-4d92-c899-fdb7b831b286"
      },
      "execution_count": 30,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "2113514\n"
          ]
        },
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[('_:nb53a24408607424384c1357880ce1bc7xb0',\n",
              "  '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "  '<http://schema.org/Mountain>',\n",
              "  '<https://peakery.com/dragontail-peak-washington/>')]"
            ]
          },
          "metadata": {},
          "execution_count": 30
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "# Exercice: Computing the VoiD for the Nt File with PySpark RDD\n",
        "\n",
        "Write RDD PySpark for the following queries (your can ignore the construct statement, just compute the select part...)\n",
        "\n",
        "- QB1 CONSTRUCT { <D> v:triples ?x }\n",
        "WHERE { SELECT (COUNT(*) AS ?x) WHERE { ?s ?p ?o } }\n",
        "\n",
        "- QB2 CONSTRUCT { <D> v:classes ?x }\n",
        "WHERE { SELECT (COUNT(DISTINCT ?o) AS ?x) WHERE { ?s a ?o } }\n",
        "\n",
        "- QB3 CONSTRUCT { <D> v:properties ?x }\n",
        "WHERE { SELECT (COUNT(DISTINCT ?p) AS ?x) WHERE { ?s ?p ?o } }\n",
        "\n",
        "- QB4 CONSTRUCT { <D> v:distinctSubjects ?x }\n",
        "WHERE { SELECT (COUNT(DISTINCT ?s) AS ?x) WHERE { ?s ?p ?o } }\n",
        "\n",
        "- QB5 CONSTRUCT { <D> v:distinctObjects ?x }\n",
        "WHERE { SELECT (COUNT(DISTINCT ?o) AS ?x) WHERE { ?s ?p ?o } }"
      ],
      "metadata": {
        "id": "jdXPbI9LfGYT"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "print(triples.map(lambda x: x[0]).distinct().count())\n",
        "print(triples.map(lambda x: x[1]).distinct().count())\n",
        "print(triples.map(lambda x: x[2]).distinct().count())\n",
        "print(triples.filter(lambda x: x[1]==\"<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>\").map(lambda x: x[2]).distinct().count())\n"
      ],
      "metadata": {
        "id": "i7Zn5QkkhWhV",
        "outputId": "6aec72ae-825d-484a-f69c-0c4f8a5924a2",
        "colab": {
          "base_uri": "https://localhost:8080/"
        }
      },
      "execution_count": 31,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "487829\n",
            "253\n",
            "829323\n",
            "304\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "- QC1 CONSTRUCT { <D> v:classPartition [ v:class ?c ] } WHERE { ?s a ?c }\n",
        "\n",
        "- QC2 CONSTRUCT { <D> v:classPartition [ v:class ?c ; v:triples ?x ] }\n",
        "WHERE { SELECT (COUNT(?p) AS ?x) ?c WHERE { ?s a ?c ; ?p ?o } GROUP BY ?c }\n",
        "- QC3 CONSTRUCT { <D> v:classPartition [ v:class ?c ; v:classes ?x ] }\n",
        "WHERE { SELECT (COUNT(DISTINCT ?d) AS ?x) ?c WHERE { ?s a ?c , ?d } GROUP BY ?c }\n",
        "- QC4 CONSTRUCT { <D> v:classPartition [ v:class ?c ; v:properties ?x ] }\n",
        "WHERE { SELECT (COUNT(DISTINCT ?p) AS ?x) ?c WHERE { ?s a ?c ; ?p ?o } GROUP BY ?c } \n",
        "- QC5 CONSTRUCT { <D> v:classPartition [ v:class ?c ; v:distinctSubjects ?x ] }\n",
        "WHERE { SELECT (COUNT(DISTINCT ?s) AS ?x) ?c WHERE { ?s a ?c } GROUP BY ?c }\n",
        "- QC6 CONSTRUCT { <D> v:classPartition [ v:class ?c ; v:distinctObjects ?x ] }\n",
        "WHERE { SELECT (COUNT(DISTINCT ?o) AS ?x) ?c WHERE { ?s a ?c ; ?p ?o } GROUP BY ?c }\n",
        "\n",
        "READ the DOC !! https://spark.apache.org/docs/latest/rdd-programming-guide.html#rdd-operations "
      ],
      "metadata": {
        "id": "S1Ap0MclgvfK"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "## testing operators \n",
        "## hmm join consider only pairs !!\n",
        "sc=spark.sparkContext\n",
        "x = sc.parallelize([(\"a\", 1,\"x\"), (\"b\", 4,\"y\")])\n",
        "y = sc.parallelize([(\"a\", 2,\"z\"), (\"a\", 3,\"w\")])\n",
        "sorted(x.join(y).collect())\n"
      ],
      "metadata": {
        "id": "JIOGT_Pp9eKI",
        "outputId": "d3543eea-2eaa-496a-a782-bcbe33b78b7b",
        "colab": {
          "base_uri": "https://localhost:8080/"
        }
      },
      "execution_count": 32,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[('a', (1, 2)), ('a', (1, 3))]"
            ]
          },
          "metadata": {},
          "execution_count": 32
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "## keyby\n",
        "print(sc.parallelize(range(0,3)).collect())\n",
        "sc.parallelize(range(0,3)).keyBy(lambda x: x*x).collect()"
      ],
      "metadata": {
        "id": "KsaNYL10-qQl",
        "outputId": "aa4b282b-6023-476b-a4c7-95684e4d898b",
        "colab": {
          "base_uri": "https://localhost:8080/"
        }
      },
      "execution_count": 33,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "[0, 1, 2]\n"
          ]
        },
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[(0, 0), (1, 1), (4, 2)]"
            ]
          },
          "metadata": {},
          "execution_count": 33
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# testing simple GC2 on simple data\n",
        "\n",
        "#simple data\n",
        "data=sc.parallelize([(\"s1\",\"a\",\"prof\"),(\"s1\",\"name\",\"pascal\"),(\"s2\",\"a\",\"prof\"),(\"s2\",\"name\",\"hala\"),(\"s3\",\"a\",\"student\"),(\"s3\",\"name\",\"tom\")])\n",
        "\n",
        "# \n",
        "# select count(?p) where {\n",
        "#    ?s a ?c . #tp1\n",
        "#    ?s ?p ?o #tp2\n",
        "#} groupby ?c\n",
        "\n",
        "tp1=data.filter(lambda x: x[1]==\"a\").keyBy(lambda x: x[0])\n",
        "print(\"tp1:\",tp1.collect())\n",
        "tp2=data.keyBy(lambda x:x[0])\n",
        "print(\"tp2:\",tp2.collect())\n",
        "bgp=tp1.join(tp2).values()\n",
        "print(\"tp1 . tp2:\",bgp.mapValues(list).collect())\n",
        "bgp.mapValues(list).collect()\n",
        "\n",
        "\n",
        "groupby=bgp.keyBy(lambda x: x[0][2]).groupByKey()\n",
        "groupby.mapValues(list).collect()\n",
        "#print(\"goupby ?c:\",groupby.mapValues(list).collect())\n",
        "\n",
        "#keep only unique predicate in the bag\n",
        "# list(dict.fromkeys -> eliminate duplicate in a python list\n",
        "gbp=groupby.mapValues(lambda x: list(dict.fromkeys(list(map(lambda bag: bag[1][1],x)))))\n",
        "#print(\"goupby ?c projection:\",gbp.collect())\n",
        "gbp.collect()\n",
        "\n",
        "# remember avoid collect on real execution...\n",
        "print(\"final:\",gbp.mapValues(lambda x: len(x)).collect())\n",
        "\n",
        "\n",
        "\n"
      ],
      "metadata": {
        "id": "-3x4epj1_1en",
        "outputId": "bc3611f8-5e28-4ee3-ebf4-2f8352c46eea",
        "colab": {
          "base_uri": "https://localhost:8080/"
        }
      },
      "execution_count": 42,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "tp1: [('s1', ('s1', 'a', 'prof')), ('s2', ('s2', 'a', 'prof')), ('s3', ('s3', 'a', 'student'))]\n",
            "tp2: [('s1', ('s1', 'a', 'prof')), ('s1', ('s1', 'name', 'pascal')), ('s2', ('s2', 'a', 'prof')), ('s2', ('s2', 'name', 'hala')), ('s3', ('s3', 'a', 'student')), ('s3', ('s3', 'name', 'tom'))]\n",
            "tp1 . tp2: [(('s1', 'a', 'prof'), ['s1', 'a', 'prof']), (('s1', 'a', 'prof'), ['s1', 'name', 'pascal']), (('s3', 'a', 'student'), ['s3', 'a', 'student']), (('s3', 'a', 'student'), ['s3', 'name', 'tom']), (('s2', 'a', 'prof'), ['s2', 'a', 'prof']), (('s2', 'a', 'prof'), ['s2', 'name', 'hala'])]\n",
            "final: [('student', 2), ('prof', 2)]\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "triples.filter(lambda x: x[1]==\"<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>\" and  x[2]==\"<https://schema.org/Mountain>\").distinct().count()\n"
      ],
      "metadata": {
        "id": "LoWOYHIfcNru",
        "outputId": "1143af42-cba3-43b3-b896-72700dd2e0bf",
        "colab": {
          "base_uri": "https://localhost:8080/"
        }
      },
      "execution_count": 49,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "22258"
            ]
          },
          "metadata": {},
          "execution_count": 49
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "Montagne et plage..."
      ],
      "metadata": {
        "id": "7HrYOCMkf4dK"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "tp1=triples.filter(lambda x: x[1]==\"<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>\" and x[2]==\"<https://schema.org/Mountain>\").keyBy(lambda x: x[3])\n",
        "tp2=triples.filter(lambda x: x[1]==\"<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>\" and x[2]==\"<https://schema.org/Beach>\").keyBy(lambda x: x[3])\n",
        "joined=tp2.join(tp1)\n",
        "joined.take(5)\n"
      ],
      "metadata": {
        "id": "Di-p34__fvlo",
        "outputId": "a13457a1-e9ee-4313-a27e-93c1343e01bd",
        "colab": {
          "base_uri": "https://localhost:8080/"
        }
      },
      "execution_count": 55,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[('<https://mapcarta.com/fr/17320490>',\n",
              "  (('_:node1flttgbvhx28909215',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/17320490>'),\n",
              "   ('_:node1flttgbvhx28909182',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Mountain>',\n",
              "    '<https://mapcarta.com/fr/17320490>'))),\n",
              " ('<https://mapcarta.com/fr/17320490>',\n",
              "  (('_:node1flttgbvhx28909215',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/17320490>'),\n",
              "   ('_:node1flttgbvhx28909222',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Mountain>',\n",
              "    '<https://mapcarta.com/fr/17320490>'))),\n",
              " ('<https://mapcarta.com/fr/17320490>',\n",
              "  (('_:node1flttgbvhx28909215',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/17320490>'),\n",
              "   ('_:node1flttgbvhx28909223',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Mountain>',\n",
              "    '<https://mapcarta.com/fr/17320490>'))),\n",
              " ('<https://mapcarta.com/fr/17320490>',\n",
              "  (('_:node1flttgbvhx28909215',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/17320490>'),\n",
              "   ('_:node1flttgbvhx28909224',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Mountain>',\n",
              "    '<https://mapcarta.com/fr/17320490>'))),\n",
              " ('<https://mapcarta.com/fr/17320490>',\n",
              "  (('_:node1flttgbvhx28909215',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/17320490>'),\n",
              "   ('_:node1flttgbvhx28909225',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Mountain>',\n",
              "    '<https://mapcarta.com/fr/17320490>')))]"
            ]
          },
          "metadata": {},
          "execution_count": 55
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# bs = sujet des Beach\n",
        "bs=joined.values().map(lambda x : x[0]).keyBy(lambda x : x[0])\n",
        "name=triples.filter(lambda x: x[1]==\"<https://schema.org/name>\").keyBy(lambda x: x[0])\n",
        "bs.join(name).collect()"
      ],
      "metadata": {
        "id": "ka1aoKBbjdIG",
        "outputId": "34b9f85c-b6d1-4308-a74f-7eeb01e895c7",
        "colab": {
          "base_uri": "https://localhost:8080/"
        }
      },
      "execution_count": 70,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[('_:node1flttgbvhx28909217',\n",
              "  (('_:node1flttgbvhx28909217',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/17320490>'),\n",
              "   ('_:node1flttgbvhx28909217',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Plage',\n",
              "    'Ait'))),\n",
              " ('_:node1flttgbvhx28909217',\n",
              "  (('_:node1flttgbvhx28909217',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/17320490>'),\n",
              "   ('_:node1flttgbvhx28909217',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Plage',\n",
              "    'Ait'))),\n",
              " ('_:node1flttgbvhx28909217',\n",
              "  (('_:node1flttgbvhx28909217',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/17320490>'),\n",
              "   ('_:node1flttgbvhx28909217',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Plage',\n",
              "    'Ait'))),\n",
              " ('_:node1flttgbvhx28909217',\n",
              "  (('_:node1flttgbvhx28909217',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/17320490>'),\n",
              "   ('_:node1flttgbvhx28909217',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Plage',\n",
              "    'Ait'))),\n",
              " ('_:node1flttgbvhx28909217',\n",
              "  (('_:node1flttgbvhx28909217',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/17320490>'),\n",
              "   ('_:node1flttgbvhx28909217',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Plage',\n",
              "    'Ait'))),\n",
              " ('_:node1flttgbvhx28909217',\n",
              "  (('_:node1flttgbvhx28909217',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/17320490>'),\n",
              "   ('_:node1flttgbvhx28909217',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Plage',\n",
              "    'Ait'))),\n",
              " ('_:node1flttgbvhx28909217',\n",
              "  (('_:node1flttgbvhx28909217',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/17320490>'),\n",
              "   ('_:node1flttgbvhx28909217',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Plage',\n",
              "    'Ait'))),\n",
              " ('_:node1flvnjdc5x12676447',\n",
              "  (('_:node1flvnjdc5x12676447',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/W376577203>'),\n",
              "   ('_:node1flvnjdc5x12676447',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platja',\n",
              "    'del'))),\n",
              " ('_:node1flvnjdc5x12676447',\n",
              "  (('_:node1flvnjdc5x12676447',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/W376577203>'),\n",
              "   ('_:node1flvnjdc5x12676447',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platja',\n",
              "    'del'))),\n",
              " ('_:node1flvnjdc5x12676448',\n",
              "  (('_:node1flvnjdc5x12676448',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/W376577203>'),\n",
              "   ('_:node1flvnjdc5x12676448',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Ballena\"@es'))),\n",
              " ('_:node1flvnjdc5x12676448',\n",
              "  (('_:node1flvnjdc5x12676448',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/W376577203>'),\n",
              "   ('_:node1flvnjdc5x12676448',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Ballena\"@es'))),\n",
              " ('_:node1fm00fdn1x98482348',\n",
              "  (('_:node1fm00fdn1x98482348',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/N3138022589>'),\n",
              "   ('_:node1fm00fdn1x98482348',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Totoral\"@es'))),\n",
              " ('_:node1fm00fdn1x98482348',\n",
              "  (('_:node1fm00fdn1x98482348',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/N3138022589>'),\n",
              "   ('_:node1fm00fdn1x98482348',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Totoral\"@es'))),\n",
              " ('_:node1fltidtvrx33776354',\n",
              "  (('_:node1fltidtvrx33776354',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/Stromboli>'),\n",
              "   ('_:node1fltidtvrx33776354',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Ficogrande\"@fr',\n",
              "    '<https://mapcarta.com/fr/Stromboli>'))),\n",
              " ('_:node1fltlop5nx85501516',\n",
              "  (('_:node1fltlop5nx85501516',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/Jenner>'),\n",
              "   ('_:node1fltlop5nx85501516',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Jenner',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fmcr94ugx23619747',\n",
              "  (('_:node1fmcr94ugx23619747',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/pt/N8510745614>'),\n",
              "   ('_:node1fmcr94ugx23619747',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Réduit',\n",
              "    'Beach\"@pt'))),\n",
              " ('_:node1fltlo3rux17761213',\n",
              "  (('_:node1fltlo3rux17761213',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/24450570>'),\n",
              "   ('_:node1fltlo3rux17761213',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Plage',\n",
              "    'Martin\"@fr'))),\n",
              " ('_:node1fltlo3rux17761213',\n",
              "  (('_:node1fltlo3rux17761213',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/24450570>'),\n",
              "   ('_:node1fltlo3rux17761213',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Plage',\n",
              "    'Martin\"@fr'))),\n",
              " ('_:node1fltlo3rux17761215',\n",
              "  (('_:node1fltlo3rux17761215',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/24450570>'),\n",
              "   ('_:node1fltlo3rux17761215',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Plage',\n",
              "    'aux'))),\n",
              " ('_:node1fltlo3rux17761215',\n",
              "  (('_:node1fltlo3rux17761215',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/24450570>'),\n",
              "   ('_:node1fltlo3rux17761215',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Plage',\n",
              "    'aux'))),\n",
              " ('_:node1fltlo507x91139105',\n",
              "  (('_:node1fltlo507x91139105',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/pt/N3995321272>'),\n",
              "   ('_:node1fltlo507x91139105', '<https://schema.org/name>', '\"Praia', 'da'))),\n",
              " ('_:node1fltlo507x91139105',\n",
              "  (('_:node1fltlo507x91139105',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/pt/N3995321272>'),\n",
              "   ('_:node1fltlo507x91139105', '<https://schema.org/name>', '\"Praia', 'da'))),\n",
              " ('_:node1fm5019vrx100968014',\n",
              "  (('_:node1fm5019vrx100968014',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/N7044867372>'),\n",
              "   ('_:node1fm5019vrx100968014',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Praia',\n",
              "    'da'))),\n",
              " ('_:node1fm5019vrx100968014',\n",
              "  (('_:node1fm5019vrx100968014',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/N7044867372>'),\n",
              "   ('_:node1fm5019vrx100968014',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Praia',\n",
              "    'da'))),\n",
              " ('_:node1fm5019vrx100968017',\n",
              "  (('_:node1fm5019vrx100968017',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/N7044867372>'),\n",
              "   ('_:node1fm5019vrx100968017',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Maule\"@es'))),\n",
              " ('_:node1fm5019vrx100968017',\n",
              "  (('_:node1fm5019vrx100968017',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/N7044867372>'),\n",
              "   ('_:node1fm5019vrx100968017',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Maule\"@es'))),\n",
              " ('_:node1fm5019vrx100968018',\n",
              "  (('_:node1fm5019vrx100968018',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/N7044867372>'),\n",
              "   ('_:node1fm5019vrx100968018',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platja',\n",
              "    'Petita\"@es'))),\n",
              " ('_:node1fm5019vrx100968018',\n",
              "  (('_:node1fm5019vrx100968018',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/N7044867372>'),\n",
              "   ('_:node1fm5019vrx100968018',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platja',\n",
              "    'Petita\"@es'))),\n",
              " ('_:node1fm7c5q1rx123438427',\n",
              "  (('_:node1fm7c5q1rx123438427',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/N4739725165>'),\n",
              "   ('_:node1fm7c5q1rx123438427',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Praia',\n",
              "    'da'))),\n",
              " ('_:node1flvnjoe7x68601512',\n",
              "  (('_:node1flvnjoe7x68601512',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/W278004515>'),\n",
              "   ('_:node1flvnjoe7x68601512', '<https://schema.org/name>', '\"Plage', 'de'))),\n",
              " ('_:node1flvnjoe7x68601512',\n",
              "  (('_:node1flvnjoe7x68601512',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/W278004515>'),\n",
              "   ('_:node1flvnjoe7x68601512', '<https://schema.org/name>', '\"Plage', 'de'))),\n",
              " ('_:node1flvnjoe7x68601512',\n",
              "  (('_:node1flvnjoe7x68601512',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/W278004515>'),\n",
              "   ('_:node1flvnjoe7x68601512', '<https://schema.org/name>', '\"Plage', 'de'))),\n",
              " ('_:node1flvnjoe7x68601512',\n",
              "  (('_:node1flvnjoe7x68601512',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/W278004515>'),\n",
              "   ('_:node1flvnjoe7x68601512', '<https://schema.org/name>', '\"Plage', 'de'))),\n",
              " ('_:node1flvnjejlx79939843',\n",
              "  (('_:node1flvnjejlx79939843',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/16488132>'),\n",
              "   ('_:node1flvnjejlx79939843',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Horseshoe',\n",
              "    'Bay\"@en'))),\n",
              " ('_:node1flvnjejlx79939843',\n",
              "  (('_:node1flvnjejlx79939843',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/16488132>'),\n",
              "   ('_:node1flvnjejlx79939843',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Horseshoe',\n",
              "    'Bay\"@en'))),\n",
              " ('_:node1fm5ju8cox22901597',\n",
              "  (('_:node1fm5ju8cox22901597',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/21939066>'),\n",
              "   ('_:node1fm5ju8cox22901597',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Gibney\\'s',\n",
              "    'Hawksnest'))),\n",
              " ('_:node1fm7c62d7x35554036',\n",
              "  (('_:node1fm7c62d7x35554036',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/20239370>'),\n",
              "   ('_:node1fm7c62d7x35554036', '<https://schema.org/name>', '\"Playa', 'La'))),\n",
              " ('_:node1fm7c62d7x35554036',\n",
              "  (('_:node1fm7c62d7x35554036',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/20239370>'),\n",
              "   ('_:node1fm7c62d7x35554036', '<https://schema.org/name>', '\"Playa', 'La'))),\n",
              " ('_:node1fm500qnox85218966',\n",
              "  (('_:node1fm500qnox85218966',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/W217066915>'),\n",
              "   ('_:node1fm500qnox85218966',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Cahoon',\n",
              "    'Hollow'))),\n",
              " ('_:node1fm500qnox85218966',\n",
              "  (('_:node1fm500qnox85218966',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/W217066915>'),\n",
              "   ('_:node1fm500qnox85218966',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Cahoon',\n",
              "    'Hollow'))),\n",
              " ('_:node1fm7rl4a4x51179104',\n",
              "  (('_:node1fm7rl4a4x51179104',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/pt/Cadaqu%C3%A9s>'),\n",
              "   ('_:node1fm7rl4a4x51179104',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platja',\n",
              "    'de'))),\n",
              " ('_:node1fltlokhex39135840',\n",
              "  (('_:node1fltlokhex39135840',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/N7044867372>'),\n",
              "   ('_:node1fltlokhex39135840',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Silent',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fltlokhex39135840',\n",
              "  (('_:node1fltlokhex39135840',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/N7044867372>'),\n",
              "   ('_:node1fltlokhex39135840',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Silent',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fltlokhex39135841',\n",
              "  (('_:node1fltlokhex39135841',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/N7044867372>'),\n",
              "   ('_:node1fltlokhex39135841',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"South',\n",
              "    'Padre'))),\n",
              " ('_:node1fltlokhex39135841',\n",
              "  (('_:node1fltlokhex39135841',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/N7044867372>'),\n",
              "   ('_:node1fltlokhex39135841',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"South',\n",
              "    'Padre'))),\n",
              " ('_:node1fm5jt5lax11467647',\n",
              "  (('_:node1fm5jt5lax11467647',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/26952968>'),\n",
              "   ('_:node1fm5jt5lax11467647',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Spiaggia',\n",
              "    'delle'))),\n",
              " ('_:node1fm5010pmx77233092',\n",
              "  (('_:node1fm5010pmx77233092',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/W189721398>'),\n",
              "   ('_:node1fm5010pmx77233092', '<https://schema.org/name>', '\"Praia', 'da'))),\n",
              " ('_:node1fltopkn7x75764264',\n",
              "  (('_:node1fltopkn7x75764264',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/21479292>'),\n",
              "   ('_:node1fltopkn7x75764264',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Punta'))),\n",
              " ('_:node1fltopkn7x75764265',\n",
              "  (('_:node1fltopkn7x75764265',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/21479292>'),\n",
              "   ('_:node1fltopkn7x75764265', '<https://schema.org/name>', '\"Playa', 'de'))),\n",
              " ('_:node1fm00fe7fx7224336',\n",
              "  (('_:node1fm00fe7fx7224336',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24508744>'),\n",
              "   ('_:node1fm00fe7fx7224336',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Lakelse',\n",
              "    'Lake'))),\n",
              " ('_:node1fm00fe7fx7224336',\n",
              "  (('_:node1fm00fe7fx7224336',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24508744>'),\n",
              "   ('_:node1fm00fe7fx7224336',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Lakelse',\n",
              "    'Lake'))),\n",
              " ('_:node1fm00fe7fx7224336',\n",
              "  (('_:node1fm00fe7fx7224336',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24508744>'),\n",
              "   ('_:node1fm00fe7fx7224336',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Lakelse',\n",
              "    'Lake'))),\n",
              " ('_:node1fm00fe7fx7224336',\n",
              "  (('_:node1fm00fe7fx7224336',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24508744>'),\n",
              "   ('_:node1fm00fe7fx7224336',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Lakelse',\n",
              "    'Lake'))),\n",
              " ('_:node1fm00fe7fx7224336',\n",
              "  (('_:node1fm00fe7fx7224336',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24508744>'),\n",
              "   ('_:node1fm00fe7fx7224336',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Lakelse',\n",
              "    'Lake'))),\n",
              " ('_:node1fm00fe7fx7224336',\n",
              "  (('_:node1fm00fe7fx7224336',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24508744>'),\n",
              "   ('_:node1fm00fe7fx7224336',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Lakelse',\n",
              "    'Lake'))),\n",
              " ('_:node1fm00fe7fx7224336',\n",
              "  (('_:node1fm00fe7fx7224336',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24508744>'),\n",
              "   ('_:node1fm00fe7fx7224336',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Lakelse',\n",
              "    'Lake'))),\n",
              " ('_:node1fm00fe7fx7224337',\n",
              "  (('_:node1fm00fe7fx7224337',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24508744>'),\n",
              "   ('_:node1fm00fe7fx7224337',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Gruchy\\'s',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fm00fe7fx7224337',\n",
              "  (('_:node1fm00fe7fx7224337',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24508744>'),\n",
              "   ('_:node1fm00fe7fx7224337',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Gruchy\\'s',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fm00fe7fx7224337',\n",
              "  (('_:node1fm00fe7fx7224337',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24508744>'),\n",
              "   ('_:node1fm00fe7fx7224337',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Gruchy\\'s',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fm00fe7fx7224337',\n",
              "  (('_:node1fm00fe7fx7224337',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24508744>'),\n",
              "   ('_:node1fm00fe7fx7224337',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Gruchy\\'s',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fm00fe7fx7224337',\n",
              "  (('_:node1fm00fe7fx7224337',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24508744>'),\n",
              "   ('_:node1fm00fe7fx7224337',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Gruchy\\'s',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fm00fe7fx7224337',\n",
              "  (('_:node1fm00fe7fx7224337',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24508744>'),\n",
              "   ('_:node1fm00fe7fx7224337',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Gruchy\\'s',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fm00fe7fx7224337',\n",
              "  (('_:node1fm00fe7fx7224337',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24508744>'),\n",
              "   ('_:node1fm00fe7fx7224337',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Gruchy\\'s',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fltlo6hqx94040747',\n",
              "  (('_:node1fltlo6hqx94040747',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/24669284>'),\n",
              "   ('_:node1fltlo6hqx94040747',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Grève',\n",
              "    'Qamanialuup'))),\n",
              " ('_:node1fm19d7ddx121542425',\n",
              "  (('_:node1fm19d7ddx121542425',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/16760396>'),\n",
              "   ('_:node1fm19d7ddx121542425',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Cooya',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fm00f2fdx94855857',\n",
              "  (('_:node1fm00f2fdx94855857',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/de/Puerto_Vallarta>'),\n",
              "   ('_:node1fm00f2fdx94855857',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Los'))),\n",
              " ('_:node1fm0o47h0x12042614',\n",
              "  (('_:node1fm0o47h0x12042614',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24207684>'),\n",
              "   ('_:node1fm0o47h0x12042614',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Mallory',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fm0o47h0x12042614',\n",
              "  (('_:node1fm0o47h0x12042614',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24207684>'),\n",
              "   ('_:node1fm0o47h0x12042614',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Mallory',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fm500u55x61330444',\n",
              "  (('_:node1fm500u55x61330444',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/21479238>'),\n",
              "   ('_:node1fm500u55x61330444',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Puerto'))),\n",
              " ('_:node1fm500u55x61330468',\n",
              "  (('_:node1fm500u55x61330468',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/21479238>'),\n",
              "   ('_:node1fm500u55x61330468',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Puerto'))),\n",
              " ('_:node1fm500u55x61330483',\n",
              "  (('_:node1fm500u55x61330483',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/21479238>'),\n",
              "   ('_:node1fm500u55x61330483',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"playa',\n",
              "    'parquito\"@es'))),\n",
              " ('_:node1fm500u55x61330486',\n",
              "  (('_:node1fm500u55x61330486',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/21479238>'),\n",
              "   ('_:node1fm500u55x61330486', '<https://schema.org/name>', '\"Playa', 'de'))),\n",
              " ('_:node1fm500u55x61330487',\n",
              "  (('_:node1fm500u55x61330487',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/21479238>'),\n",
              "   ('_:node1fm500u55x61330487',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Valdivia\"@es'))),\n",
              " ('_:node1fltop35kx80605802',\n",
              "  (('_:node1fltop35kx80605802',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/34488318>'),\n",
              "   ('_:node1fltop35kx80605802',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Ruskamen\"@fr',\n",
              "    '<https://mapcarta.com/fr/34488318>'))),\n",
              " ('_:node1fltop35kx80605841',\n",
              "  (('_:node1fltop35kx80605841',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/34488318>'),\n",
              "   ('_:node1fltop35kx80605841',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Plage',\n",
              "    'Jacob\"@fr'))),\n",
              " ('_:node1fltop35kx80605845',\n",
              "  (('_:node1fltop35kx80605845',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/34488318>'),\n",
              "   ('_:node1fltop35kx80605845',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Plage',\n",
              "    'Taghassa\"@fr'))),\n",
              " ('_:node1fm28uaehx63538592',\n",
              "  (('_:node1fm28uaehx63538592',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/19513940>'),\n",
              "   ('_:node1fm28uaehx63538592',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Rocamar\"@es'))),\n",
              " ('_:node1fm28uaehx63538592',\n",
              "  (('_:node1fm28uaehx63538592',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/19513940>'),\n",
              "   ('_:node1fm28uaehx63538592',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Rocamar\"@es'))),\n",
              " ('_:node1fm28uaehx63538592',\n",
              "  (('_:node1fm28uaehx63538592',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/19513940>'),\n",
              "   ('_:node1fm28uaehx63538592',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Rocamar\"@es'))),\n",
              " ('_:node1fm28uaehx63538592',\n",
              "  (('_:node1fm28uaehx63538592',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/19513940>'),\n",
              "   ('_:node1fm28uaehx63538592',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Rocamar\"@es'))),\n",
              " ('_:node1fm28uaehx63538592',\n",
              "  (('_:node1fm28uaehx63538592',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/19513940>'),\n",
              "   ('_:node1fm28uaehx63538592',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Rocamar\"@es'))),\n",
              " ('_:node1fm28uaehx63538592',\n",
              "  (('_:node1fm28uaehx63538592',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/19513940>'),\n",
              "   ('_:node1fm28uaehx63538592',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Rocamar\"@es'))),\n",
              " ('_:node1fm28uaehx63538592',\n",
              "  (('_:node1fm28uaehx63538592',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/19513940>'),\n",
              "   ('_:node1fm28uaehx63538592',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Rocamar\"@es'))),\n",
              " ('_:node1fm28uaehx63538593',\n",
              "  (('_:node1fm28uaehx63538593',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/19513940>'),\n",
              "   ('_:node1fm28uaehx63538593', '<https://schema.org/name>', '\"Playa', 'La'))),\n",
              " ('_:node1fm28uaehx63538593',\n",
              "  (('_:node1fm28uaehx63538593',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/19513940>'),\n",
              "   ('_:node1fm28uaehx63538593', '<https://schema.org/name>', '\"Playa', 'La'))),\n",
              " ('_:node1fm28uaehx63538593',\n",
              "  (('_:node1fm28uaehx63538593',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/19513940>'),\n",
              "   ('_:node1fm28uaehx63538593', '<https://schema.org/name>', '\"Playa', 'La'))),\n",
              " ('_:node1fm28uaehx63538593',\n",
              "  (('_:node1fm28uaehx63538593',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/19513940>'),\n",
              "   ('_:node1fm28uaehx63538593', '<https://schema.org/name>', '\"Playa', 'La'))),\n",
              " ('_:node1fm28uaehx63538593',\n",
              "  (('_:node1fm28uaehx63538593',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/19513940>'),\n",
              "   ('_:node1fm28uaehx63538593', '<https://schema.org/name>', '\"Playa', 'La'))),\n",
              " ('_:node1fm28uaehx63538593',\n",
              "  (('_:node1fm28uaehx63538593',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/19513940>'),\n",
              "   ('_:node1fm28uaehx63538593', '<https://schema.org/name>', '\"Playa', 'La'))),\n",
              " ('_:node1fm28uaehx63538593',\n",
              "  (('_:node1fm28uaehx63538593',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/19513940>'),\n",
              "   ('_:node1fm28uaehx63538593', '<https://schema.org/name>', '\"Playa', 'La'))),\n",
              " ('_:node1flvnj5rgx7397929',\n",
              "  (('_:node1flvnj5rgx7397929',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/19916156>'),\n",
              "   ('_:node1flvnj5rgx7397929',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Bonita\"@en'))),\n",
              " ('_:node1flvnj5rgx7397929',\n",
              "  (('_:node1flvnj5rgx7397929',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/19916156>'),\n",
              "   ('_:node1flvnj5rgx7397929',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Bonita\"@en'))),\n",
              " ('_:node1flvnj5rgx7397929',\n",
              "  (('_:node1flvnj5rgx7397929',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/19916156>'),\n",
              "   ('_:node1flvnj5rgx7397929',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Bonita\"@en'))),\n",
              " ('_:node1flvnj5rgx7397929',\n",
              "  (('_:node1flvnj5rgx7397929',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/19916156>'),\n",
              "   ('_:node1flvnj5rgx7397929',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Bonita\"@en'))),\n",
              " ('_:node1flvnj5rgx7397929',\n",
              "  (('_:node1flvnj5rgx7397929',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/19916156>'),\n",
              "   ('_:node1flvnj5rgx7397929',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Bonita\"@en'))),\n",
              " ('_:node1flvnj5rgx7397929',\n",
              "  (('_:node1flvnj5rgx7397929',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/19916156>'),\n",
              "   ('_:node1flvnj5rgx7397929',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Bonita\"@en'))),\n",
              " ('_:node1flvnj5rgx7397929',\n",
              "  (('_:node1flvnj5rgx7397929',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/19916156>'),\n",
              "   ('_:node1flvnj5rgx7397929',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Bonita\"@en'))),\n",
              " ('_:node1flvnj5rgx7397929',\n",
              "  (('_:node1flvnj5rgx7397929',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/19916156>'),\n",
              "   ('_:node1flvnj5rgx7397929',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Bonita\"@en'))),\n",
              " ('_:node1flvnj5rgx7397929',\n",
              "  (('_:node1flvnj5rgx7397929',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/19916156>'),\n",
              "   ('_:node1flvnj5rgx7397929',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Bonita\"@en'))),\n",
              " ('_:node1flvnj5rgx7397929',\n",
              "  (('_:node1flvnj5rgx7397929',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/19916156>'),\n",
              "   ('_:node1flvnj5rgx7397929',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Bonita\"@en'))),\n",
              " ('_:node1flvnj5rgx7397929',\n",
              "  (('_:node1flvnj5rgx7397929',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/19916156>'),\n",
              "   ('_:node1flvnj5rgx7397929',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Bonita\"@en'))),\n",
              " ('_:node1flvnj5rgx7397929',\n",
              "  (('_:node1flvnj5rgx7397929',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/19916156>'),\n",
              "   ('_:node1flvnj5rgx7397929',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Bonita\"@en'))),\n",
              " ('_:node1flvnj5rgx7397929',\n",
              "  (('_:node1flvnj5rgx7397929',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/19916156>'),\n",
              "   ('_:node1flvnj5rgx7397929',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Bonita\"@en'))),\n",
              " ('_:node1fltopkn7x34061979',\n",
              "  (('_:node1fltopkn7x34061979',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/19094732>'),\n",
              "   ('_:node1fltopkn7x34061979', '<https://schema.org/name>', '\"Praia', 'da'))),\n",
              " ('_:node1fltibko7x60553395',\n",
              "  (('_:node1fltibko7x60553395',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/19372510>'),\n",
              "   ('_:node1fltibko7x60553395',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Lagun\"@en'))),\n",
              " ('_:node1fltibko7x60553395',\n",
              "  (('_:node1fltibko7x60553395',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/19372510>'),\n",
              "   ('_:node1fltibko7x60553395',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Lagun\"@en'))),\n",
              " ('_:node1fltibko7x60553395',\n",
              "  (('_:node1fltibko7x60553395',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/19372510>'),\n",
              "   ('_:node1fltibko7x60553395',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Lagun\"@en'))),\n",
              " ('_:node1fltibko7x60553395',\n",
              "  (('_:node1fltibko7x60553395',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/19372510>'),\n",
              "   ('_:node1fltibko7x60553395',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Lagun\"@en'))),\n",
              " ('_:node1fm00fd0vx12571093',\n",
              "  (('_:node1fm00fd0vx12571093',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/19794340>'),\n",
              "   ('_:node1fm00fd0vx12571093',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Ravine',\n",
              "    'Diable\"@fr'))),\n",
              " ('_:node1fltootkjx49585703',\n",
              "  (('_:node1fltootkjx49585703',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/30153118>'),\n",
              "   ('_:node1fltootkjx49585703',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Cangrejo\"@es'))),\n",
              " ('_:node1fltootkjx49585706',\n",
              "  (('_:node1fltootkjx49585706',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/30153118>'),\n",
              "   ('_:node1fltootkjx49585706',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Cangrejo\"@es'))),\n",
              " ('_:node1fltoouqmx7478752',\n",
              "  (('_:node1fltoouqmx7478752',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/19584968>'),\n",
              "   ('_:node1fltoouqmx7478752', '<https://schema.org/name>', '\"Playa', 'El'))),\n",
              " ('_:node1flvnjdc5x12676443',\n",
              "  (('_:node1flvnjdc5x12676443',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/W376577203>'),\n",
              "   ('_:node1flvnjdc5x12676443', '<https://schema.org/name>', '\"Praia', 'de'))),\n",
              " ('_:node1flvnjdc5x12676443',\n",
              "  (('_:node1flvnjdc5x12676443',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/W376577203>'),\n",
              "   ('_:node1flvnjdc5x12676443', '<https://schema.org/name>', '\"Praia', 'de'))),\n",
              " ('_:node1flu986htx28961245',\n",
              "  (('_:node1flu986htx28961245',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/19789538>'),\n",
              "   ('_:node1flu986htx28961245',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Kyona',\n",
              "    'Plage\"@fr'))),\n",
              " ('_:node1fltidtvrx33776353',\n",
              "  (('_:node1fltidtvrx33776353',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/Stromboli>'),\n",
              "   ('_:node1fltidtvrx33776353',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Spiagiia',\n",
              "    'Scari\"@fr'))),\n",
              " ('_:node1flvnjas1x57991624',\n",
              "  (('_:node1flvnjas1x57991624',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/N2128318165>'),\n",
              "   ('_:node1flvnjas1x57991624',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Kaulana',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1flvnjas1x57991624',\n",
              "  (('_:node1flvnjas1x57991624',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/N2128318165>'),\n",
              "   ('_:node1flvnjas1x57991624',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Kaulana',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fltlop5nx85501494',\n",
              "  (('_:node1fltlop5nx85501494',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/Jenner>'),\n",
              "   ('_:node1fltlop5nx85501494',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Goat',\n",
              "    'Rock'))),\n",
              " ('_:node1fm7rl9ltx17307812',\n",
              "  (('_:node1fm7rl9ltx17307812',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/20028630>'),\n",
              "   ('_:node1fm7rl9ltx17307812',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Bonita\"@es'))),\n",
              " ('_:node1fm19d41rx86370090',\n",
              "  (('_:node1fm19d41rx86370090',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/pt/Es_Mercadal>'),\n",
              "   ('_:node1fm19d41rx86370090',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playas',\n",
              "    'de'))),\n",
              " ('_:node1fltlo0igx98466106',\n",
              "  (('_:node1fltlo0igx98466106',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/20109764>'),\n",
              "   ('_:node1fltlo0igx98466106', '<https://schema.org/name>', '\"Playa', 'La'))),\n",
              " ('_:node1flvnj65lx87587611',\n",
              "  (('_:node1flvnj65lx87587611',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/pt/W426695438>'),\n",
              "   ('_:node1flvnj65lx87587611',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Carlos'))),\n",
              " ('_:node1fm5019vrx100968015',\n",
              "  (('_:node1fm5019vrx100968015',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/N7044867372>'),\n",
              "   ('_:node1fm5019vrx100968015',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Puerto'))),\n",
              " ('_:node1fm5019vrx100968015',\n",
              "  (('_:node1fm5019vrx100968015',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/N7044867372>'),\n",
              "   ('_:node1fm5019vrx100968015',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Puerto'))),\n",
              " ('_:node1fm5019vrx100968016',\n",
              "  (('_:node1fm5019vrx100968016',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/N7044867372>'),\n",
              "   ('_:node1fm5019vrx100968016',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Arco\"@es'))),\n",
              " ('_:node1fm5019vrx100968016',\n",
              "  (('_:node1fm5019vrx100968016',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/N7044867372>'),\n",
              "   ('_:node1fm5019vrx100968016',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Arco\"@es'))),\n",
              " ('_:node1fltootkjx95978434',\n",
              "  (('_:node1fltootkjx95978434',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/15984770>'),\n",
              "   ('_:node1fltootkjx95978434', '<https://schema.org/name>', '\"Big', 'Wave'))),\n",
              " ('_:node1fm7c62d7x35554037',\n",
              "  (('_:node1fm7c62d7x35554037',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/20239370>'),\n",
              "   ('_:node1fm7c62d7x35554037',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Caletilla\"@en'))),\n",
              " ('_:node1fm7c62d7x35554037',\n",
              "  (('_:node1fm7c62d7x35554037',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/20239370>'),\n",
              "   ('_:node1fm7c62d7x35554037',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Caletilla\"@en'))),\n",
              " ('_:node1fltlokhex39135839',\n",
              "  (('_:node1fltlokhex39135839',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/N7044867372>'),\n",
              "   ('_:node1fltlokhex39135839',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Neguac',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fltlokhex39135839',\n",
              "  (('_:node1fltlokhex39135839',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/N7044867372>'),\n",
              "   ('_:node1fltlokhex39135839',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Neguac',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fltlokhex39135842',\n",
              "  (('_:node1fltlokhex39135842',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/N7044867372>'),\n",
              "   ('_:node1fltlokhex39135842',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Patterson',\n",
              "    'Point'))),\n",
              " ('_:node1fltlokhex39135842',\n",
              "  (('_:node1fltlokhex39135842',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/N7044867372>'),\n",
              "   ('_:node1fltlokhex39135842',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Patterson',\n",
              "    'Point'))),\n",
              " ('_:node1fltlokhex39135843',\n",
              "  (('_:node1fltlokhex39135843',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/N7044867372>'),\n",
              "   ('_:node1fltlokhex39135843',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Pocita',\n",
              "    'de'))),\n",
              " ('_:node1fltlokhex39135843',\n",
              "  (('_:node1fltlokhex39135843',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/N7044867372>'),\n",
              "   ('_:node1fltlokhex39135843',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Pocita',\n",
              "    'de'))),\n",
              " ('_:node1fm28tps2x40063421',\n",
              "  (('_:node1fm28tps2x40063421',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/N2121168578>'),\n",
              "   ('_:node1fm28tps2x40063421',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Purple',\n",
              "    'Turtle'))),\n",
              " ('_:node1flvnjeg5x43170982',\n",
              "  (('_:node1flvnjeg5x43170982',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/20286148>'),\n",
              "   ('_:node1flvnjeg5x43170982',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platja',\n",
              "    'Es'))),\n",
              " ('_:node1flvnjeg5x43170982',\n",
              "  (('_:node1flvnjeg5x43170982',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/20286148>'),\n",
              "   ('_:node1flvnjeg5x43170982',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platja',\n",
              "    'Es'))),\n",
              " ('_:node1flvnjeg5x43170982',\n",
              "  (('_:node1flvnjeg5x43170982',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/20286148>'),\n",
              "   ('_:node1flvnjeg5x43170982',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platja',\n",
              "    'Es'))),\n",
              " ('_:node1flvnjeg5x43170982',\n",
              "  (('_:node1flvnjeg5x43170982',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/20286148>'),\n",
              "   ('_:node1flvnjeg5x43170982',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platja',\n",
              "    'Es'))),\n",
              " ('_:node1fltopkn7x75764226',\n",
              "  (('_:node1fltopkn7x75764226',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/21479292>'),\n",
              "   ('_:node1fltopkn7x75764226', '<https://schema.org/name>', '\"Playa', 'de'))),\n",
              " ('_:node1fltopkn7x75764266',\n",
              "  (('_:node1fltopkn7x75764266',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/21479292>'),\n",
              "   ('_:node1fltopkn7x75764266',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'del'))),\n",
              " ('_:node1fltopkn7x75764267',\n",
              "  (('_:node1fltopkn7x75764267',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/21479292>'),\n",
              "   ('_:node1fltopkn7x75764267',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Boca'))),\n",
              " ('_:node1fm19e3jjx8684995',\n",
              "  (('_:node1fm19e3jjx8684995',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24111940>'),\n",
              "   ('_:node1fm19e3jjx8684995',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Hills',\n",
              "    'Bar\"@en'))),\n",
              " ('_:node1fm00f2l7x83585667',\n",
              "  (('_:node1fm00f2l7x83585667',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/N4746573170>'),\n",
              "   ('_:node1fm00f2l7x83585667', '<https://schema.org/name>', '\"Praia', 'da'))),\n",
              " ('_:node1fm19d7ddx121542423',\n",
              "  (('_:node1fm19d7ddx121542423',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/16760396>'),\n",
              "   ('_:node1fm19d7ddx121542423',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Newell',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1flvnjl1fx57744493',\n",
              "  (('_:node1flvnjl1fx57744493',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/21280208>'),\n",
              "   ('_:node1flvnjl1fx57744493',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Elk',\n",
              "    'Shoals\"@en'))),\n",
              " ('_:node1flvnjl1fx57744493',\n",
              "  (('_:node1flvnjl1fx57744493',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/21280208>'),\n",
              "   ('_:node1flvnjl1fx57744493',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Elk',\n",
              "    'Shoals\"@en'))),\n",
              " ('_:node1flvnjl1fx57744493',\n",
              "  (('_:node1flvnjl1fx57744493',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/21280208>'),\n",
              "   ('_:node1flvnjl1fx57744493',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Elk',\n",
              "    'Shoals\"@en'))),\n",
              " ('_:node1flvnjl1fx57744493',\n",
              "  (('_:node1flvnjl1fx57744493',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/21280208>'),\n",
              "   ('_:node1flvnjl1fx57744493',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Elk',\n",
              "    'Shoals\"@en'))),\n",
              " ('_:node1flvnjl1fx57744493',\n",
              "  (('_:node1flvnjl1fx57744493',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/21280208>'),\n",
              "   ('_:node1flvnjl1fx57744493',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Elk',\n",
              "    'Shoals\"@en'))),\n",
              " ('_:node1flvnjl1fx57744493',\n",
              "  (('_:node1flvnjl1fx57744493',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/21280208>'),\n",
              "   ('_:node1flvnjl1fx57744493',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Elk',\n",
              "    'Shoals\"@en'))),\n",
              " ('_:node1flvnjl1fx57744493',\n",
              "  (('_:node1flvnjl1fx57744493',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/21280208>'),\n",
              "   ('_:node1flvnjl1fx57744493',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Elk',\n",
              "    'Shoals\"@en'))),\n",
              " ('_:node1fm0j598ex44312700',\n",
              "  (('_:node1fm0j598ex44312700',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/Wellfleet>'),\n",
              "   ('_:node1fm0j598ex44312700',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Mayo',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fm500qnox90013276',\n",
              "  (('_:node1fm500qnox90013276',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24332266>'),\n",
              "   ('_:node1fm500qnox90013276',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Murderers',\n",
              "    'Bar\"@en'))),\n",
              " ('_:node1fm500qnox90013276',\n",
              "  (('_:node1fm500qnox90013276',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24332266>'),\n",
              "   ('_:node1fm500qnox90013276',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Murderers',\n",
              "    'Bar\"@en'))),\n",
              " ('_:node1fm28sjo6x2033439',\n",
              "  (('_:node1fm28sjo6x2033439',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/20286148>'),\n",
              "   ('_:node1fm28sjo6x2033439',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Es',\n",
              "    'Canar\"@es'))),\n",
              " ('_:node1fm28sjo6x2033439',\n",
              "  (('_:node1fm28sjo6x2033439',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/20286148>'),\n",
              "   ('_:node1fm28sjo6x2033439',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Es',\n",
              "    'Canar\"@es'))),\n",
              " ('_:node1fm28sjo6x2033439',\n",
              "  (('_:node1fm28sjo6x2033439',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/20286148>'),\n",
              "   ('_:node1fm28sjo6x2033439',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Es',\n",
              "    'Canar\"@es'))),\n",
              " ('_:node1fm28sjo6x2033439',\n",
              "  (('_:node1fm28sjo6x2033439',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/20286148>'),\n",
              "   ('_:node1fm28sjo6x2033439',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Es',\n",
              "    'Canar\"@es'))),\n",
              " ('_:node1fm7c5nbnx102767212',\n",
              "  (('_:node1fm7c5nbnx102767212',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/24557688>'),\n",
              "   ('_:node1fm7c5nbnx102767212',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Plage',\n",
              "    'Fournier\"@fr'))),\n",
              " ('_:node1fm00f2fdx94855855',\n",
              "  (('_:node1fm00f2fdx94855855',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/de/Puerto_Vallarta>'),\n",
              "   ('_:node1fm00f2fdx94855855',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playas',\n",
              "    'Vallarta\"@de'))),\n",
              " ('_:node1fm500u55x61330469',\n",
              "  (('_:node1fm500u55x61330469',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/21479238>'),\n",
              "   ('_:node1fm500u55x61330469',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Puerto'))),\n",
              " ('_:node1fm500u55x61330474',\n",
              "  (('_:node1fm500u55x61330474',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/21479238>'),\n",
              "   ('_:node1fm500u55x61330474', '<https://schema.org/name>', '\"Playa', 'de'))),\n",
              " ('_:node1fm500u55x61330482',\n",
              "  (('_:node1fm500u55x61330482',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/21479238>'),\n",
              "   ('_:node1fm500u55x61330482', '<https://schema.org/name>', '\"Playa', 'El'))),\n",
              " ('_:node1fltlnu92x101342410',\n",
              "  (('_:node1fltlnu92x101342410',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/30514420>'),\n",
              "   ('_:node1fltlnu92x101342410',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Beach',\n",
              "    'Loreto'))),\n",
              " ('_:node1fltop35kx80605843',\n",
              "  (('_:node1fltop35kx80605843',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/34488318>'),\n",
              "   ('_:node1fltop35kx80605843',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Plage',\n",
              "    'Bissonnette\"@fr'))),\n",
              " ('_:node1fltop35kx80605844',\n",
              "  (('_:node1fltop35kx80605844',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/34488318>'),\n",
              "   ('_:node1fltop35kx80605844', '<https://schema.org/name>', '\"Playa', 'de'))),\n",
              " ('_:node1fm0j5tabx17212681',\n",
              "  (('_:node1fm0j5tabx17212681',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/Dildo>'),\n",
              "   ('_:node1fm0j5tabx17212681',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Backside\"@fr',\n",
              "    '<https://mapcarta.com/fr/Dildo>'))),\n",
              " ('_:node1flvnjjc0x38165103',\n",
              "  (('_:node1flvnjjc0x38165103',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/35431084>'),\n",
              "   ('_:node1flvnjjc0x38165103', '<https://schema.org/name>', '\"Plage', 'de'))),\n",
              " ('_:node1flvnjjc0x38165103',\n",
              "  (('_:node1flvnjjc0x38165103',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/35431084>'),\n",
              "   ('_:node1flvnjjc0x38165103', '<https://schema.org/name>', '\"Plage', 'de'))),\n",
              " ('_:node1flvnjjc0x38165103',\n",
              "  (('_:node1flvnjjc0x38165103',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/35431084>'),\n",
              "   ('_:node1flvnjjc0x38165103', '<https://schema.org/name>', '\"Plage', 'de'))),\n",
              " ('_:node1flvnjjc0x38165103',\n",
              "  (('_:node1flvnjjc0x38165103',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/35431084>'),\n",
              "   ('_:node1flvnjjc0x38165103', '<https://schema.org/name>', '\"Plage', 'de'))),\n",
              " ('_:node1flvnjjc0x38165103',\n",
              "  (('_:node1flvnjjc0x38165103',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/35431084>'),\n",
              "   ('_:node1flvnjjc0x38165103', '<https://schema.org/name>', '\"Plage', 'de'))),\n",
              " ('_:node1flvnjjc0x38165103',\n",
              "  (('_:node1flvnjjc0x38165103',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/35431084>'),\n",
              "   ('_:node1flvnjjc0x38165103', '<https://schema.org/name>', '\"Plage', 'de'))),\n",
              " ('_:node1flvnjjc0x38165103',\n",
              "  (('_:node1flvnjjc0x38165103',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/35431084>'),\n",
              "   ('_:node1flvnjjc0x38165103', '<https://schema.org/name>', '\"Plage', 'de'))),\n",
              " ('_:node1flvnjjc0x38165103',\n",
              "  (('_:node1flvnjjc0x38165103',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/35431084>'),\n",
              "   ('_:node1flvnjjc0x38165103', '<https://schema.org/name>', '\"Plage', 'de'))),\n",
              " ('_:node1fm19daigx121968156',\n",
              "  (('_:node1fm19daigx121968156',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/17361244>'),\n",
              "   ('_:node1fm19daigx121968156',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Plage',\n",
              "    'de'))),\n",
              " ('_:node1fltopkn7x34061962',\n",
              "  (('_:node1fltopkn7x34061962',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/19094732>'),\n",
              "   ('_:node1fltopkn7x34061962', '<https://schema.org/name>', '\"Praia', 'da'))),\n",
              " ('_:node1fltibng1x65601620',\n",
              "  (('_:node1fltibng1x65601620',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24582880>'),\n",
              "   ('_:node1fltibng1x65601620',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Bens',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fltootkjx49585705',\n",
              "  (('_:node1fltootkjx49585705',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/30153118>'),\n",
              "   ('_:node1fltootkjx49585705',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Cangrejo\"@es'))),\n",
              " ('_:node1fm28u1a4x4327870',\n",
              "  (('_:node1fm28u1a4x4327870',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/27677498>'),\n",
              "   ('_:node1fm28u1a4x4327870',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Pantai',\n",
              "    'Pasir'))),\n",
              " ('_:node1fltoouqmx7478727',\n",
              "  (('_:node1fltoouqmx7478727',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/19584968>'),\n",
              "   ('_:node1fltoouqmx7478727', '<https://schema.org/name>', '\"Playa', 'El'))),\n",
              " ('_:node1fltoouqmx7478768',\n",
              "  (('_:node1fltoouqmx7478768',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/19584968>'),\n",
              "   ('_:node1fltoouqmx7478768', '<https://schema.org/name>', '\"Playa', 'de'))),\n",
              " ('_:node1fltoouqmx7478769',\n",
              "  (('_:node1fltoouqmx7478769',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/19584968>'),\n",
              "   ('_:node1fltoouqmx7478769',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platja',\n",
              "    'del'))),\n",
              " ('_:node1fltoouqmx7478770',\n",
              "  (('_:node1fltoouqmx7478770',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/19584968>'),\n",
              "   ('_:node1fltoouqmx7478770', '<https://schema.org/name>', '\"Platja', 'de'))),\n",
              " ('_:node1fm28u8lhx37678311',\n",
              "  (('_:node1fm28u8lhx37678311',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/W171400901>'),\n",
              "   ('_:node1fm28u8lhx37678311', '<https://schema.org/name>', '\"Playa', 'de'))),\n",
              " ('_:node1flttgbvhx28909215',\n",
              "  (('_:node1flttgbvhx28909215',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/17320490>'),\n",
              "   ('_:node1flttgbvhx28909215',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Ddas\"@fr',\n",
              "    '<https://mapcarta.com/fr/17320490>'))),\n",
              " ('_:node1flttgbvhx28909215',\n",
              "  (('_:node1flttgbvhx28909215',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/17320490>'),\n",
              "   ('_:node1flttgbvhx28909215',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Ddas\"@fr',\n",
              "    '<https://mapcarta.com/fr/17320490>'))),\n",
              " ('_:node1flttgbvhx28909215',\n",
              "  (('_:node1flttgbvhx28909215',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/17320490>'),\n",
              "   ('_:node1flttgbvhx28909215',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Ddas\"@fr',\n",
              "    '<https://mapcarta.com/fr/17320490>'))),\n",
              " ('_:node1flttgbvhx28909215',\n",
              "  (('_:node1flttgbvhx28909215',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/17320490>'),\n",
              "   ('_:node1flttgbvhx28909215',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Ddas\"@fr',\n",
              "    '<https://mapcarta.com/fr/17320490>'))),\n",
              " ('_:node1flttgbvhx28909215',\n",
              "  (('_:node1flttgbvhx28909215',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/17320490>'),\n",
              "   ('_:node1flttgbvhx28909215',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Ddas\"@fr',\n",
              "    '<https://mapcarta.com/fr/17320490>'))),\n",
              " ('_:node1flttgbvhx28909215',\n",
              "  (('_:node1flttgbvhx28909215',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/17320490>'),\n",
              "   ('_:node1flttgbvhx28909215',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Ddas\"@fr',\n",
              "    '<https://mapcarta.com/fr/17320490>'))),\n",
              " ('_:node1flttgbvhx28909215',\n",
              "  (('_:node1flttgbvhx28909215',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/17320490>'),\n",
              "   ('_:node1flttgbvhx28909215',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Ddas\"@fr',\n",
              "    '<https://mapcarta.com/fr/17320490>'))),\n",
              " ('_:node1flvnjdc5x12676400',\n",
              "  (('_:node1flvnjdc5x12676400',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/W376577203>'),\n",
              "   ('_:node1flvnjdc5x12676400',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Majahuitas',\n",
              "    'Resort\"@es'))),\n",
              " ('_:node1flvnjdc5x12676400',\n",
              "  (('_:node1flvnjdc5x12676400',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/W376577203>'),\n",
              "   ('_:node1flvnjdc5x12676400',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Majahuitas',\n",
              "    'Resort\"@es'))),\n",
              " ('_:node1flvnjdc5x12676444',\n",
              "  (('_:node1flvnjdc5x12676444',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/W376577203>'),\n",
              "   ('_:node1flvnjdc5x12676444',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'nudista'))),\n",
              " ('_:node1flvnjdc5x12676444',\n",
              "  (('_:node1flvnjdc5x12676444',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/W376577203>'),\n",
              "   ('_:node1flvnjdc5x12676444',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'nudista'))),\n",
              " ('_:node1flvnjdc5x12676445',\n",
              "  (('_:node1flvnjdc5x12676445',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/W376577203>'),\n",
              "   ('_:node1flvnjdc5x12676445',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'del'))),\n",
              " ('_:node1flvnjdc5x12676445',\n",
              "  (('_:node1flvnjdc5x12676445',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/W376577203>'),\n",
              "   ('_:node1flvnjdc5x12676445',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'del'))),\n",
              " ('_:node1flvnjdc5x12676446',\n",
              "  (('_:node1flvnjdc5x12676446',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/W376577203>'),\n",
              "   ('_:node1flvnjdc5x12676446',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Cala',\n",
              "    'Cocon\"@es'))),\n",
              " ('_:node1flvnjdc5x12676446',\n",
              "  (('_:node1flvnjdc5x12676446',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/W376577203>'),\n",
              "   ('_:node1flvnjdc5x12676446',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Cala',\n",
              "    'Cocon\"@es'))),\n",
              " ('_:node1flvnj8qbx54091288',\n",
              "  (('_:node1flvnj8qbx54091288',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/24500436>'),\n",
              "   ('_:node1flvnj8qbx54091288', '<https://schema.org/name>', '\"Plage', 'du'))),\n",
              " ('_:node1flvnj8qbx54091298',\n",
              "  (('_:node1flvnj8qbx54091298',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/24500436>'),\n",
              "   ('_:node1flvnj8qbx54091298', '<https://schema.org/name>', '\"Plage', 'du'))),\n",
              " ('_:node1fltooqf5x65270074',\n",
              "  (('_:node1fltooqf5x65270074',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/pt/27422668>'),\n",
              "   ('_:node1fltooqf5x65270074', '<https://schema.org/name>', '\"Praia', 'da'))),\n",
              " ('_:node1fltooqf5x65270074',\n",
              "  (('_:node1fltooqf5x65270074',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/pt/27422668>'),\n",
              "   ('_:node1fltooqf5x65270074', '<https://schema.org/name>', '\"Praia', 'da'))),\n",
              " ('_:node1fltooqf5x65270102',\n",
              "  (('_:node1fltooqf5x65270102',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/pt/27422668>'),\n",
              "   ('_:node1fltooqf5x65270102',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Praia',\n",
              "    'dos'))),\n",
              " ('_:node1fm0j4rbjx32060309',\n",
              "  (('_:node1fm0j4rbjx32060309',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/22310190>'),\n",
              "   ('_:node1fm0j4rbjx32060309',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Hales',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fm0j4rbjx32060309',\n",
              "  (('_:node1fm0j4rbjx32060309',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/22310190>'),\n",
              "   ('_:node1fm0j4rbjx32060309',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Hales',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fm0j4rbjx32060309',\n",
              "  (('_:node1fm0j4rbjx32060309',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/22310190>'),\n",
              "   ('_:node1fm0j4rbjx32060309',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Hales',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fm0j4rbjx32060309',\n",
              "  (('_:node1fm0j4rbjx32060309',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/22310190>'),\n",
              "   ('_:node1fm0j4rbjx32060309',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Hales',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fm0j4rbjx32060309',\n",
              "  (('_:node1fm0j4rbjx32060309',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/22310190>'),\n",
              "   ('_:node1fm0j4rbjx32060309',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Hales',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fm0j4rbjx32060309',\n",
              "  (('_:node1fm0j4rbjx32060309',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/22310190>'),\n",
              "   ('_:node1fm0j4rbjx32060309',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Hales',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fm0j4rbjx32060309',\n",
              "  (('_:node1fm0j4rbjx32060309',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/22310190>'),\n",
              "   ('_:node1fm0j4rbjx32060309',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Hales',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fm0j4rbjx32060309',\n",
              "  (('_:node1fm0j4rbjx32060309',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/22310190>'),\n",
              "   ('_:node1fm0j4rbjx32060309',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Hales',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fm0j4rbjx32060309',\n",
              "  (('_:node1fm0j4rbjx32060309',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/22310190>'),\n",
              "   ('_:node1fm0j4rbjx32060309',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Hales',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fm0j4rbjx32060309',\n",
              "  (('_:node1fm0j4rbjx32060309',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/22310190>'),\n",
              "   ('_:node1fm0j4rbjx32060309',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Hales',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fm0j4rbjx32060309',\n",
              "  (('_:node1fm0j4rbjx32060309',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/22310190>'),\n",
              "   ('_:node1fm0j4rbjx32060309',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Hales',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fm0j4rbjx32060309',\n",
              "  (('_:node1fm0j4rbjx32060309',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/22310190>'),\n",
              "   ('_:node1fm0j4rbjx32060309',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Hales',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fm0j4rbjx32060309',\n",
              "  (('_:node1fm0j4rbjx32060309',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/22310190>'),\n",
              "   ('_:node1fm0j4rbjx32060309',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Hales',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fm0j4rbjx32060309',\n",
              "  (('_:node1fm0j4rbjx32060309',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/22310190>'),\n",
              "   ('_:node1fm0j4rbjx32060309',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Hales',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fltidtvrx33776351',\n",
              "  (('_:node1fltidtvrx33776351',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/Stromboli>'),\n",
              "   ('_:node1fltidtvrx33776351',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Plage',\n",
              "    'Forgia'))),\n",
              " ('_:node1fm00fgdsx12488090',\n",
              "  (('_:node1fm00fgdsx12488090',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/20107466>'),\n",
              "   ('_:node1fm00fgdsx12488090',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Bahía'))),\n",
              " ('_:node1fm00fgdsx12488090',\n",
              "  (('_:node1fm00fgdsx12488090',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/20107466>'),\n",
              "   ('_:node1fm00fgdsx12488090',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Bahía'))),\n",
              " ('_:node1fm28u5utx22309330',\n",
              "  (('_:node1fm28u5utx22309330',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/15439230>'),\n",
              "   ('_:node1fm28u5utx22309330',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Plage',\n",
              "    'des'))),\n",
              " ('_:node1fm28u5utx22309330',\n",
              "  (('_:node1fm28u5utx22309330',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/15439230>'),\n",
              "   ('_:node1fm28u5utx22309330',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Plage',\n",
              "    'des'))),\n",
              " ('_:node1fm28u5utx22309330',\n",
              "  (('_:node1fm28u5utx22309330',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/15439230>'),\n",
              "   ('_:node1fm28u5utx22309330',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Plage',\n",
              "    'des'))),\n",
              " ('_:node1fm28u5utx22309330',\n",
              "  (('_:node1fm28u5utx22309330',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/15439230>'),\n",
              "   ('_:node1fm28u5utx22309330',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Plage',\n",
              "    'des'))),\n",
              " ('_:node1fm28u5utx22309330',\n",
              "  (('_:node1fm28u5utx22309330',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/15439230>'),\n",
              "   ('_:node1fm28u5utx22309330',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Plage',\n",
              "    'des'))),\n",
              " ('_:node1fm28u5utx22309330',\n",
              "  (('_:node1fm28u5utx22309330',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/15439230>'),\n",
              "   ('_:node1fm28u5utx22309330',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Plage',\n",
              "    'des'))),\n",
              " ('_:node1fm28u5utx22309330',\n",
              "  (('_:node1fm28u5utx22309330',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/15439230>'),\n",
              "   ('_:node1fm28u5utx22309330',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Plage',\n",
              "    'des'))),\n",
              " ('_:node1fm19d41rx86370086',\n",
              "  (('_:node1fm19d41rx86370086',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/pt/Es_Mercadal>'),\n",
              "   ('_:node1fm19d41rx86370086',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Cala',\n",
              "    'Tirant\"@pt'))),\n",
              " ('_:node1fltlo0igx98466112',\n",
              "  (('_:node1fltlo0igx98466112',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/20109764>'),\n",
              "   ('_:node1fltlo0igx98466112', '<https://schema.org/name>', '\"Playa', 'La'))),\n",
              " ('_:node1fm5019vrx100967971',\n",
              "  (('_:node1fm5019vrx100967971',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/N7044867372>'),\n",
              "   ('_:node1fm5019vrx100967971',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Point',\n",
              "    'Isabel\"@es'))),\n",
              " ('_:node1fm5019vrx100967971',\n",
              "  (('_:node1fm5019vrx100967971',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/N7044867372>'),\n",
              "   ('_:node1fm5019vrx100967971',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Point',\n",
              "    'Isabel\"@es'))),\n",
              " ('_:node1fm5019vrx100968019',\n",
              "  (('_:node1fm5019vrx100968019',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/N7044867372>'),\n",
              "   ('_:node1fm5019vrx100968019',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'de'))),\n",
              " ('_:node1fm5019vrx100968019',\n",
              "  (('_:node1fm5019vrx100968019',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/N7044867372>'),\n",
              "   ('_:node1fm5019vrx100968019',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'de'))),\n",
              " ('_:node1fm00f5opx99235413',\n",
              "  (('_:node1fm00f5opx99235413',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/N5909202275>'),\n",
              "   ('_:node1fm00f5opx99235413',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Totoral\"@es'))),\n",
              " ('_:node1fm00f5opx99235413',\n",
              "  (('_:node1fm00f5opx99235413',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/N5909202275>'),\n",
              "   ('_:node1fm00f5opx99235413',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Totoral\"@es'))),\n",
              " ('_:node1fm00f5opx99235413',\n",
              "  (('_:node1fm00f5opx99235413',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/N5909202275>'),\n",
              "   ('_:node1fm00f5opx99235413',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Totoral\"@es'))),\n",
              " ('_:node1fltootkjx95978439',\n",
              "  (('_:node1fltootkjx95978439',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/15984770>'),\n",
              "   ('_:node1fltootkjx95978439',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Turtle',\n",
              "    'Cove'))),\n",
              " ('_:node1fm5ju8cox22901596',\n",
              "  (('_:node1fm5ju8cox22901596',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/21939066>'),\n",
              "   ('_:node1fm5ju8cox22901596',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Honeymoon',\n",
              "    'Beach\"@en'))),\n",
              " ('_:node1fm5ju8cox22901598',\n",
              "  (('_:node1fm5ju8cox22901598',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/21939066>'),\n",
              "   ('_:node1fm5ju8cox22901598',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Public',\n",
              "    'Hawknest'))),\n",
              " ('_:node1fm7c5o0ox27442760',\n",
              "  (('_:node1fm7c5o0ox27442760',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/24051688>'),\n",
              "   ('_:node1fm7c5o0ox27442760',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Haikioawa',\n",
              "    'Landing\"@es'))),\n",
              " ('_:node1fltlokhex39135789',\n",
              "  (('_:node1fltlokhex39135789',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/N7044867372>'),\n",
              "   ('_:node1fltlokhex39135789',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Point',\n",
              "    'Isabel\"@en'))),\n",
              " ('_:node1fltlokhex39135789',\n",
              "  (('_:node1fltlokhex39135789',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/N7044867372>'),\n",
              "   ('_:node1fltlokhex39135789',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Point',\n",
              "    'Isabel\"@en'))),\n",
              " ('_:node1fltlokhex39135838',\n",
              "  (('_:node1fltlokhex39135838',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/N7044867372>'),\n",
              "   ('_:node1fltlokhex39135838',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Point',\n",
              "    'Impossible'))),\n",
              " ('_:node1fltlokhex39135838',\n",
              "  (('_:node1fltlokhex39135838',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/N7044867372>'),\n",
              "   ('_:node1fltlokhex39135838',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Point',\n",
              "    'Impossible'))),\n",
              " ('_:node1fm28tpv7x32108720',\n",
              "  (('_:node1fm28tpv7x32108720',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/19750298>'),\n",
              "   ('_:node1fm28tpv7x32108720',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Punta',\n",
              "    'Rebujina\"@es'))),\n",
              " ('_:node1fm00f4nkx6791340',\n",
              "  (('_:node1fm00f4nkx6791340',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/20284940>'),\n",
              "   ('_:node1fm00f4nkx6791340',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Bahía'))),\n",
              " ('_:node1flvnj4h1x73778192',\n",
              "  (('_:node1flvnj4h1x73778192',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/Boston/South_Boston>'),\n",
              "   ('_:node1flvnj4h1x73778192',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Carson',\n",
              "    'Beach\"@es'))),\n",
              " ('_:node1fm5jt5lax11467644',\n",
              "  (('_:node1fm5jt5lax11467644',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/26952968>'),\n",
              "   ('_:node1fm5jt5lax11467644',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Spiaggia',\n",
              "    'di'))),\n",
              " ('_:node1fm5jt5lax11467645',\n",
              "  (('_:node1fm5jt5lax11467645',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/26952968>'),\n",
              "   ('_:node1fm5jt5lax11467645',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Spiaggia',\n",
              "    'Del'))),\n",
              " ('_:node1fltopkn7x75764262',\n",
              "  (('_:node1fltopkn7x75764262',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/21479292>'),\n",
              "   ('_:node1fltopkn7x75764262',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Al',\n",
              "    'Muntazah'))),\n",
              " ('_:node1fltopkn7x75764263',\n",
              "  (('_:node1fltopkn7x75764263',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/21479292>'),\n",
              "   ('_:node1fltopkn7x75764263',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platges',\n",
              "    'de'))),\n",
              " ('_:node1fm19e3jjx8684994',\n",
              "  (('_:node1fm19e3jjx8684994',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24111940>'),\n",
              "   ('_:node1fm19e3jjx8684994',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Emory',\n",
              "    'Bar\"@en'))),\n",
              " ('_:node1flvnjaavx116301050',\n",
              "  (('_:node1flvnjaavx116301050',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/19094366>'),\n",
              "   ('_:node1flvnjaavx116301050',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Praia',\n",
              "    'da'))),\n",
              " ('_:node1fltoorcnx97330073',\n",
              "  (('_:node1fltoorcnx97330073',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24057898>'),\n",
              "   ('_:node1fltoorcnx97330073',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"D.T.',\n",
              "    'Fleming'))),\n",
              " ('_:node1fltoorcnx97330073',\n",
              "  (('_:node1fltoorcnx97330073',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24057898>'),\n",
              "   ('_:node1fltoorcnx97330073',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"D.T.',\n",
              "    'Fleming'))),\n",
              " ('_:node1fltoorcnx97330073',\n",
              "  (('_:node1fltoorcnx97330073',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24057898>'),\n",
              "   ('_:node1fltoorcnx97330073',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"D.T.',\n",
              "    'Fleming'))),\n",
              " ('_:node1fltoorcnx97330073',\n",
              "  (('_:node1fltoorcnx97330073',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/24057898>'),\n",
              "   ('_:node1fltoorcnx97330073',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"D.T.',\n",
              "    'Fleming'))),\n",
              " ('_:node1fltloeg3x28895940',\n",
              "  (('_:node1fltloeg3x28895940',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/17370612>'),\n",
              "   ('_:node1fltloeg3x28895940',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Bolonia\"@es'))),\n",
              " ('_:node1fm0j598ex44312680',\n",
              "  (('_:node1fm0j598ex44312680',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/Wellfleet>'),\n",
              "   ('_:node1fm0j598ex44312680',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Cahoon',\n",
              "    'Hollow'))),\n",
              " ('_:node1fm0j598ex44312680',\n",
              "  (('_:node1fm0j598ex44312680',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/Wellfleet>'),\n",
              "   ('_:node1fm0j598ex44312680',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Cahoon',\n",
              "    'Hollow'))),\n",
              " ('_:node1fm7c5m9mx104617657',\n",
              "  (('_:node1fm7c5m9mx104617657',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/17373058>'),\n",
              "   ('_:node1fm7c5m9mx104617657',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platja',\n",
              "    'de'))),\n",
              " ('_:node1fm7c5m9mx104617657',\n",
              "  (('_:node1fm7c5m9mx104617657',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/17373058>'),\n",
              "   ('_:node1fm7c5m9mx104617657',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platja',\n",
              "    'de'))),\n",
              " ('_:node1fm7c5m9mx104617657',\n",
              "  (('_:node1fm7c5m9mx104617657',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/17373058>'),\n",
              "   ('_:node1fm7c5m9mx104617657',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platja',\n",
              "    'de'))),\n",
              " ('_:node1fm7c5m9mx104617657',\n",
              "  (('_:node1fm7c5m9mx104617657',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/17373058>'),\n",
              "   ('_:node1fm7c5m9mx104617657',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platja',\n",
              "    'de'))),\n",
              " ('_:node1fm7c5m9mx104617657',\n",
              "  (('_:node1fm7c5m9mx104617657',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/17373058>'),\n",
              "   ('_:node1fm7c5m9mx104617657',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platja',\n",
              "    'de'))),\n",
              " ('_:node1fm7c5m9mx104617657',\n",
              "  (('_:node1fm7c5m9mx104617657',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/17373058>'),\n",
              "   ('_:node1fm7c5m9mx104617657',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platja',\n",
              "    'de'))),\n",
              " ('_:node1fm7c5m9mx104617657',\n",
              "  (('_:node1fm7c5m9mx104617657',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/17373058>'),\n",
              "   ('_:node1fm7c5m9mx104617657',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platja',\n",
              "    'de'))),\n",
              " ('_:node1fm7c5m9mx104617657',\n",
              "  (('_:node1fm7c5m9mx104617657',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/17373058>'),\n",
              "   ('_:node1fm7c5m9mx104617657',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platja',\n",
              "    'de'))),\n",
              " ('_:node1fm7c5m9mx104617657',\n",
              "  (('_:node1fm7c5m9mx104617657',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/17373058>'),\n",
              "   ('_:node1fm7c5m9mx104617657',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platja',\n",
              "    'de'))),\n",
              " ('_:node1fm7c5m9mx104617657',\n",
              "  (('_:node1fm7c5m9mx104617657',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/17373058>'),\n",
              "   ('_:node1fm7c5m9mx104617657',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platja',\n",
              "    'de'))),\n",
              " ('_:node1fm7c5m9mx104617657',\n",
              "  (('_:node1fm7c5m9mx104617657',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/17373058>'),\n",
              "   ('_:node1fm7c5m9mx104617657',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platja',\n",
              "    'de'))),\n",
              " ('_:node1fm7c5m9mx104617657',\n",
              "  (('_:node1fm7c5m9mx104617657',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/17373058>'),\n",
              "   ('_:node1fm7c5m9mx104617657',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platja',\n",
              "    'de'))),\n",
              " ('_:node1fm7c5m9mx104617657',\n",
              "  (('_:node1fm7c5m9mx104617657',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/17373058>'),\n",
              "   ('_:node1fm7c5m9mx104617657',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platja',\n",
              "    'de'))),\n",
              " ('_:node1fm7c5m9mx104617657',\n",
              "  (('_:node1fm7c5m9mx104617657',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/17373058>'),\n",
              "   ('_:node1fm7c5m9mx104617657',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Platja',\n",
              "    'de'))),\n",
              " ('_:node1fm28tbaqx12372351',\n",
              "  (('_:node1fm28tbaqx12372351',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/30061866>'),\n",
              "   ('_:node1fm28tbaqx12372351',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Taiti\"@es'))),\n",
              " ('_:node1fm500u55x61330467',\n",
              "  (('_:node1fm500u55x61330467',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/21479238>'),\n",
              "   ('_:node1fm500u55x61330467', '<https://schema.org/name>', '\"Playa', 'de'))),\n",
              " ('_:node1fm500u55x61330484',\n",
              "  (('_:node1fm500u55x61330484',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/21479238>'),\n",
              "   ('_:node1fm500u55x61330484',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Aviones\"@es'))),\n",
              " ('_:node1fm500u55x61330485',\n",
              "  (('_:node1fm500u55x61330485',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/21479238>'),\n",
              "   ('_:node1fm500u55x61330485',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Langosta\"@es'))),\n",
              " ('_:node1fltop35kx80605842',\n",
              "  (('_:node1fltop35kx80605842',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/34488318>'),\n",
              "   ('_:node1fltop35kx80605842',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Polletts',\n",
              "    'Cove'))),\n",
              " ('_:node1fltop35kx80605846',\n",
              "  (('_:node1fltop35kx80605846',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/34488318>'),\n",
              "   ('_:node1fltop35kx80605846',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Staffords',\n",
              "    'Gulch\"@fr'))),\n",
              " ('_:node1fm0j5tabx17212683',\n",
              "  (('_:node1fm0j5tabx17212683',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/fr/Dildo>'),\n",
              "   ('_:node1fm0j5tabx17212683',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Backside',\n",
              "    'Beach\"@fr'))),\n",
              " ('_:node1fltlos1ux55090011',\n",
              "  (('_:node1fltlos1ux55090011',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/20146710>'),\n",
              "   ('_:node1fltlos1ux55090011',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Totoral\"@es'))),\n",
              " ('_:node1fltibko7x60553399',\n",
              "  (('_:node1fltibko7x60553399',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/19372510>'),\n",
              "   ('_:node1fltibko7x60553399',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Grote',\n",
              "    'Knip\"@en'))),\n",
              " ('_:node1fltibko7x60553399',\n",
              "  (('_:node1fltibko7x60553399',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/19372510>'),\n",
              "   ('_:node1fltibko7x60553399',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Grote',\n",
              "    'Knip\"@en'))),\n",
              " ('_:node1fltibko7x60553399',\n",
              "  (('_:node1fltibko7x60553399',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/19372510>'),\n",
              "   ('_:node1fltibko7x60553399',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Grote',\n",
              "    'Knip\"@en'))),\n",
              " ('_:node1fltibko7x60553399',\n",
              "  (('_:node1fltibko7x60553399',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/19372510>'),\n",
              "   ('_:node1fltibko7x60553399',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Grote',\n",
              "    'Knip\"@en'))),\n",
              " ('_:node1fltootkjx49585704',\n",
              "  (('_:node1fltootkjx49585704',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/30153118>'),\n",
              "   ('_:node1fltootkjx49585704',\n",
              "    '<https://schema.org/name>',\n",
              "    '\"Playa',\n",
              "    'Cangrejo\"@es'))),\n",
              " ('_:node1fltoouqmx7478753',\n",
              "  (('_:node1fltoouqmx7478753',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/19584968>'),\n",
              "   ('_:node1fltoouqmx7478753', '<https://schema.org/name>', '\"Playa', 'El'))),\n",
              " ('_:node1fltoouqmx7478767',\n",
              "  (('_:node1fltoouqmx7478767',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/19584968>'),\n",
              "   ('_:node1fltoouqmx7478767', '<https://schema.org/name>', '\"Playa', 'La'))),\n",
              " ('_:node1fltoouqmx7478771',\n",
              "  (('_:node1fltoouqmx7478771',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/19584968>'),\n",
              "   ('_:node1fltoouqmx7478771', '<https://schema.org/name>', '\"Playa', 'El'))),\n",
              " ('_:node1fltoouqmx7478772',\n",
              "  (('_:node1fltoouqmx7478772',\n",
              "    '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
              "    '<https://schema.org/Beach>',\n",
              "    '<https://mapcarta.com/es/19584968>'),\n",
              "   ('_:node1fltoouqmx7478772', '<https://schema.org/name>', '\"Playa', 'La')))]"
            ]
          },
          "metadata": {},
          "execution_count": 70
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "#QC2 for real now...\n",
        "\n",
        "tp1=triples.filter(lambda x: x[1]==\"<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>\").keyBy(lambda x: x[0])\n",
        "tp2=triples.keyBy(lambda x:x[0])\n",
        "bgp=tp1.join(tp2).values()\n",
        "\n",
        "groupby=bgp.keyBy(lambda x: x[0][2]).groupByKey()\n",
        "\n",
        "#keep only unique predicate in the bag\n",
        "gbp=groupby.mapValues(lambda x: list(dict.fromkeys(list(map(lambda bag: bag[1][1],x)))))\n",
        "\n",
        "# remember avoid collect on real execution...\n",
        "gbp.mapValues(lambda x: len(x)).collect()\n"
      ],
      "metadata": {
        "id": "God-8HdrhYUa",
        "outputId": "f1670f3f-d751-4943-a1a6-37d1fcf6fae6",
        "colab": {
          "base_uri": "https://localhost:8080/"
        }
      },
      "execution_count": 35,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[('<http://schema.org/CatholicChurch>', 3),\n",
              " ('<http://schema.org/NewsArticle>', 11),\n",
              " ('<http://schema.org/TireShop>', 8),\n",
              " ('<https://schema.org/Airport>', 11),\n",
              " ('<http://dbpedia.org/ontology/Location>', 50),\n",
              " ('<https://schema.org/ShoppingCenter>', 10),\n",
              " ('<http://schema.org/SearchAction>', 3),\n",
              " ('<https://schema.org/ConvenienceStore>', 11),\n",
              " ('<https://schema.org/Zoo>', 5),\n",
              " ('<https://schema.org/IceCreamShop>', 3),\n",
              " ('<https://schema.org/PoliceStation>', 11),\n",
              " ('<https://schema.org/HardwareStore>', 10),\n",
              " ('<http://schema.org/CafeOrCoffeeShop>', 9),\n",
              " ('<http://schema.org/Map>', 2),\n",
              " ('<http://www.w3.org/2002/07/owl#Thing>', 50),\n",
              " ('<https://schema.org/AdministrativeArea>', 12),\n",
              " ('<http://schema.org/ListItem>', 7),\n",
              " ('<https://schema.org/BarOrPub>', 10),\n",
              " ('<http://schema.org/PoliceStation>', 8),\n",
              " ('<http://schema.org/GeoCoordinates>', 7),\n",
              " ('<https://schema.org/LakeBodyOfWater>', 11),\n",
              " ('<https://schema.org/FireStation>', 10),\n",
              " ('<http://schema.org/LocationFeatureSpecification>', 3),\n",
              " ('<https://schema.org/AutoWash>', 4),\n",
              " ('<https://schema.org/Park>', 11),\n",
              " ('<http://schema.org/Hospital>', 10),\n",
              " ('<http://schema.org/CivicStructure>', 3),\n",
              " ('<https://schema.org/Store>', 6),\n",
              " ('<http://schema.org/Campground>', 14),\n",
              " ('<http://schema.org/place>', 4),\n",
              " ('<https://schema.org/Organization>', 8),\n",
              " ('<https://schema.org/SportsActivityLocation>', 11),\n",
              " ('<http://schema.org/EducationalOrganization>', 11),\n",
              " ('<https://schema.org/BeautySalon>', 3),\n",
              " ('<http://schema.org/BankOrCreditUnion>', 8),\n",
              " ('<https://schema.org/AutoRepair>', 3),\n",
              " ('<https://schema.org/Resort>', 11),\n",
              " ('<https://schema.org/Locksmith>', 3),\n",
              " ('<https://schema.org/House>', 11),\n",
              " ('<https://stmartin.suedlicheweinstrasse.de/st-martin/sehenswuerdigkeiten/infosystem/Kalmit_Maikammer/ImageObject>',\n",
              "  1),\n",
              " ('<http://schema.org/LakeBodyOfWater>', 7),\n",
              " ('<http://schema.org/Article>', 19),\n",
              " ('<http://schema.org/HighSchool>', 8),\n",
              " ('<https://schema.org/PostOffice>', 11),\n",
              " ('<http://schema.org/ExerciseAction>', 10),\n",
              " ('<http://schema.org/TravelAction>', 16),\n",
              " ('<http://schema.org/PostOffice>', 8),\n",
              " ('<http://schema.org/GeoShape>', 2),\n",
              " ('<http://schema.org/LocalBusiness>', 21),\n",
              " ('<http://schema.org/OfficeEquipmentStore>', 9),\n",
              " ('<https://schema.org/Apartment>', 3),\n",
              " ('<http://schema.org/Motel>', 16),\n",
              " ('<http://schema.org/Photograph>', 8),\n",
              " ('<http://schema.org/ReadAction>', 2),\n",
              " ('<https://schema.org/BusStop>', 11),\n",
              " ('<https://schema.org/Dentist>', 3),\n",
              " ('<http://schema.org/Brand>', 2),\n",
              " ('<http://schema.org/Church>', 12),\n",
              " ('<https://schema.org/HairSalon>', 3),\n",
              " ('<https://schema.org/ClothingStore>', 4),\n",
              " ('<https://schema.org/Cemetery>', 11),\n",
              " ('<https://schema.org/LocalBusiness>', 5),\n",
              " ('<https://schema.org/Mountain>', 19),\n",
              " ('<http://schema.org/Product>', 9),\n",
              " ('<http://schema.org/TouristAttraction>', 33),\n",
              " ('<https://schema.org/AmusementPark>', 11),\n",
              " ('<https://schema.org/Hospital>', 11),\n",
              " ('<https://schema.org/BusStation>', 10),\n",
              " ('<https://schema.org/Synagogue>', 5),\n",
              " ('<https://schema.org/CityHall>', 10),\n",
              " ('<https://schema.org/AutoRental>', 3),\n",
              " ('<https://schema.org/Church>', 11),\n",
              " ('<http://schema.org/RiverBodyofWater>', 9),\n",
              " ('<https://schema.org/BookStore>', 3),\n",
              " ('<http://schema.org/BarOrPub>', 19),\n",
              " ('<http://schema.org/Blog>', 9),\n",
              " ('<http://schema.org/LodgingBusiness>', 16),\n",
              " ('<https://schema.org/GasStation>', 11),\n",
              " ('<https://schema.org/RiverBodyOfWater>', 11),\n",
              " ('<http://schema.org/Landform>', 8),\n",
              " ('<http://schema.org/Website>', 2),\n",
              " ('<https://schema.org/TravelAction>', 6),\n",
              " ('<http://schema.org/GroceryStore>', 9),\n",
              " ('<http://schema.org/Tourist%20Destination>', 8),\n",
              " ('<http://schema.org/FastFoodRestaurant>', 11),\n",
              " ('<http://schema.org/ConvenienceStore>', 8),\n",
              " ('<https://schema.org/EventVenue>', 3),\n",
              " ('<http://schema.org/WPHeader>', 1),\n",
              " ('<http://schema.org/HVACBusiness>', 9),\n",
              " ('<https://schema.org/PerformingArtsTheater>', 6),\n",
              " ('<http://dbpedia.org/ontology/NaturalPlace>', 50),\n",
              " ('<http://schema.org/ContactPoint>', 6),\n",
              " ('<http://schema.org/AnimalShelter>', 9),\n",
              " ('<http://schema.org/Pond>', 8),\n",
              " ('<http://schema.org/Store>', 11),\n",
              " ('<https://schema.org/ComputerStore>', 3),\n",
              " ('<http://schema.org/VeterinaryCare>', 8),\n",
              " ('<https://schema.org/Canal>', 11),\n",
              " ('<https://schema.org/TireShop>', 3),\n",
              " ('<http://schema.org/PropertyValue>', 3),\n",
              " ('<https://schema.org/DefenceEstablishment>', 10),\n",
              " ('<https://schema.org/GeoCoordinates>', 4),\n",
              " ('<https://schema.org/SkiResort>', 9),\n",
              " ('<http://schema.org/Resort>', 9),\n",
              " ('<https://schema.org/BikeStore>', 3),\n",
              " ('<http://schema.org/CommentAction>', 3),\n",
              " ('<http://schema.org/HardwareStore>', 10),\n",
              " ('<https://schema.org/BoatTerminal>', 4),\n",
              " ('<https://schema.org/Place>', 12),\n",
              " ('<https://schema.org/SportingGoodsStore>', 4),\n",
              " ('<https://schema.org/AutoDealer>', 4),\n",
              " ('<http://schema.org/AggregateRating>', 8),\n",
              " ('<http://schema.org/Florist>', 11),\n",
              " ('<https://schema.org/GroceryStore>', 10),\n",
              " ('<https://schema.org/ArtGallery>', 4),\n",
              " ('<http://schema.org/BoatTrip>', 3),\n",
              " ('<http://schema.org/AutoPartsStore>', 9),\n",
              " ('<https://schema.org/CafeOrCoffeeShop>', 11),\n",
              " ('<https://schema.org/Campground>', 11),\n",
              " ('<https://schema.org/Volcano>', 11),\n",
              " ('<https://schema.org/Residence>', 11),\n",
              " ('<https://schema.org/TouristInformationCenter>', 3),\n",
              " ('<https://schema.org/BowlingAlley>', 3),\n",
              " ('<http://schema.org/AutomatedTeller>', 6),\n",
              " ('<http://schema.org/Museum>', 18),\n",
              " ('<https://schema.org/JewelryStore>', 3),\n",
              " ('<http://schema.org/Winery>', 11),\n",
              " ('<https://schema.org/InsuranceAgency>', 3),\n",
              " ('<https://maps.kernvalley.us/NGO>', 1),\n",
              " ('<http://schema.org/Blogposting>', 14),\n",
              " ('<http://schema.org/Organization>', 16),\n",
              " ('<http://schema.org/Preschool>', 8),\n",
              " ('<http://schema.org/civicstructure>', 3),\n",
              " ('<https://schema.org/Restaurant>', 10),\n",
              " ('<http://schema.org/Mosque>', 3),\n",
              " ('<http://schema.org/Answer>', 2),\n",
              " ('<https://schema.org/StadiumOrArena>', 11),\n",
              " ('<http://schema.org/Park>', 17),\n",
              " ('<https://schema.org/Museum>', 11),\n",
              " ('<https://schema.org/PawnShop>', 3),\n",
              " ('<https://schema.org/Casino>', 4),\n",
              " ('<http://schema.org/EmergencyService>', 6),\n",
              " ('<https://schema.org/MedicalBusiness>', 3),\n",
              " ('<http://schema.org/BedAndBreakfast>', 8),\n",
              " ('<https://schema.org/MusicStore>', 3),\n",
              " ('<http://schema.org/park>', 2),\n",
              " ('<http://schema.org/Cemetery>', 14),\n",
              " ('<http://schema.org/OpeningHoursSpecification>', 4),\n",
              " ('<https://schema.org/LandmarksOrHistoricalBuildings>', 11),\n",
              " ('<http://schema.org/FoodEstablishment>', 15),\n",
              " ('<https://schema.org/Pharmacy>', 3),\n",
              " ('<http://schema.org/Audience>', 3),\n",
              " ('<http://schema.org/RealEstateAgent>', 10),\n",
              " ('<http://schema.org/WPSideBar>', 2),\n",
              " ('<https://schema.org/Winery>', 3),\n",
              " ('<http://schema.org/Language>', 3),\n",
              " ('<http://schema.org/TouristDestination>', 18),\n",
              " ('<http://schema.org/FireStation>', 8),\n",
              " ('<http://schema.org/Rating>', 5),\n",
              " ('<https://schema.org/CivicStructure>', 4),\n",
              " ('<https://schema.org/MobilePhoneStore>', 3),\n",
              " ('<https://schema.org/MotorcycleDealer>', 11),\n",
              " ('<http://schema.org/Pharmacy>', 9),\n",
              " ('<http://schema.org/SearchResultsPage>', 1),\n",
              " ('<http://schema.org/CreativeWork>', 3),\n",
              " ('<http://schema.org/AutoRepair>', 9),\n",
              " ('<https://schema.org/ImageObject>', 7),\n",
              " ('<https://schema.org/MedicalClinic>', 10),\n",
              " ('<https://schema.org/TrainStation>', 11),\n",
              " ('<https://schema.org/BreadcrumbList>', 2),\n",
              " ('<https://schema.org/Country>', 2),\n",
              " ('<http://schema.org/TouristTrip>', 7),\n",
              " ('<http://schema.org/WPAdBlock>', 1),\n",
              " ('<http://schema.org/BreadcrumbList>', 2),\n",
              " ('<https://schema.org/Brewery>', 4),\n",
              " ('<https://schema.org/RealEstateAgent>', 3),\n",
              " ('<http://schema.org/Review>', 11),\n",
              " ('<https://schema.org/AutoPartsStore>', 3),\n",
              " ('<https://schema.org/RVPark>', 3),\n",
              " ('<http://schema.org/AdministrativeArea>', 12),\n",
              " ('<https://schema.org/AutomotiveBusiness>', 4),\n",
              " ('<http://schema.org/Offer>', 11),\n",
              " ('<https://schema.org/WholesaleStore>', 3),\n",
              " ('<http://schema.org/SelfStorage>', 9),\n",
              " ('<https://schema.org/GolfCourse>', 6),\n",
              " ('<http://schema.org/LandmarksOrHistoricalBuildings>', 14),\n",
              " ('<https://schema.org/NightClub>', 3),\n",
              " ('<https://schema.org/HinduTemple>', 6),\n",
              " ('<https://schema.org/Person>', 3),\n",
              " ('<https://schema.org/ElectronicsStore>', 3),\n",
              " ('<http://schema.org/WebPage>', 13),\n",
              " ('<https://schema.org/Bridge>', 11),\n",
              " ('<https://schema.org/Pond>', 11),\n",
              " ('<http://schema.org/BowlingAlley>', 13),\n",
              " ('<https://schema.org/DaySpa>', 10),\n",
              " ('<https://schema.org/DonateAction>', 2),\n",
              " ('<https://schema.org/Emergency>', 3),\n",
              " ('<https://schema.org/LiquorStore>', 3),\n",
              " ('<https://schema.org/Distillery>', 6),\n",
              " ('<https://schema.org/TennisComplex>', 4),\n",
              " ('<https://schema.org/Bakery>', 4),\n",
              " ('<https://schema.org/FurnitureStore>', 3),\n",
              " ('<https://schema.org/WebPage>', 3),\n",
              " ('<http://schema.org/PostalAddress>', 13),\n",
              " ('<https://schema.org/EducationalOrganization>', 6),\n",
              " ('<http://schema.org/ParkingFacility>', 5),\n",
              " ('<https://schema.org/Map>', 2),\n",
              " ('<https://schema.org/EmploymentAgency>', 3),\n",
              " ('<https://schema.org/Physician>', 3),\n",
              " ('<http://schema.org/propertyValue>', 3),\n",
              " ('<https://schema.org/Reservoir>', 11),\n",
              " ('<http://schema.org/RiverBodyOfWater>', 8),\n",
              " ('<https://schema.org/Quotation>', 3),\n",
              " ('<https://schema.org/HealthClub>', 3),\n",
              " ('<http://schema.org/EntryPoint>', 2),\n",
              " ('<http://schema.org/Library>', 8),\n",
              " ('<http://schema.org/QuantitativeValue>', 2),\n",
              " ('<http://schema.org/mountain>', 4),\n",
              " ('<http://schema.org/Hotel>', 15),\n",
              " ('<https://schema.org/TouristAttraction>', 11),\n",
              " ('<http://data-vocabulary.org/Breadcrumb>', 3),\n",
              " ('<https://schema.org/State>', 11),\n",
              " ('<http://www.wikidata.org/entity/Q8502>', 50),\n",
              " ('<https://schema.org/EmergencyService>', 10),\n",
              " ('<http://schema.org/Country>', 3),\n",
              " ('<http://schema.org/Place>', 65),\n",
              " ('<https://schema.org/DryCleaningOrLaundry>', 3),\n",
              " ('<http://schema.org/InteractionCounter>', 4),\n",
              " ('<http://schema.org/Mountain>', 93),\n",
              " ('<http://schema.org/WPFooter>', 2),\n",
              " ('<https://schema.org/Courthouse>', 10),\n",
              " ('<http://schema.org/ExercisePlan>', 2),\n",
              " ('<https://schema.org/Hotel>', 11),\n",
              " ('<https://schema.org/TaxiStand>', 3),\n",
              " ('<http://schema.org/ItemList>', 13),\n",
              " ('<https://schema.org/CollegeOrUniversity>', 11),\n",
              " ('<https://schema.org/SubwayStation>', 6),\n",
              " ('<http://dbpedia.org/ontology/Mountain>', 50),\n",
              " ('<https://schema.org/BodyOfWater>', 11),\n",
              " ('<https://schema.org/MovieTheater>', 10),\n",
              " ('<https://schema.org/ParkingFacility>', 10),\n",
              " ('<http://schema.org/Person>', 12),\n",
              " ('<http://schema.org/BodyOfWater>', 7),\n",
              " ('<https://schema.org/Landform>', 12),\n",
              " ('<http://schema.org/GasStation>', 10),\n",
              " ('<http://schema.org/NewsMediaOrganization>', 10),\n",
              " ('<http://schema.org/Restaurant>', 20),\n",
              " ('<https://schema.org/Beach>', 11),\n",
              " ('<http://schema.org/Waterfall>', 10),\n",
              " ('<https://schema.org/ChildCare>', 3),\n",
              " ('<http://schema.org/ImageObject>', 17),\n",
              " ('<https://schema.org/BankOrCreditUnion>', 11),\n",
              " ('<http://schema.org/Volcano>', 5),\n",
              " ('<https://schema.org/DepartmentStore>', 4),\n",
              " ('<https://schema.org/School>', 11),\n",
              " ('<https://schema.org/GardenStore>', 3),\n",
              " ('<https://schema.org/ShoeStore>', 3),\n",
              " ('<https://schema.org/Waterfall>', 11),\n",
              " ('<http://schema.org/SkiResort>', 18),\n",
              " ('<https://schema.org/Playground>', 10),\n",
              " ('<http://schema.org/City>', 9),\n",
              " ('<http://schema.org/SportsActivityLocation>', 9),\n",
              " ('<https://schema.org/GovernmentBuilding>', 11),\n",
              " ('<https://schema.org/Hostel>', 6),\n",
              " ('<https://schema.org/PlaceOfWorship>', 11),\n",
              " ('<http://schema.org/BuddhistTemple>', 3),\n",
              " ('<https://schema.org/Library>', 5),\n",
              " ('<http://schema.org/School>', 8),\n",
              " ('<https://schema.org/Attorney>', 3),\n",
              " ('<https://schema.org/InternetCafe>', 3),\n",
              " ('<http://www.schema.org/SiteNavigationElement>', 3),\n",
              " ('<https://schema.org/BuddhistTemple>', 11),\n",
              " ('<https://schema.org/HobbyShop>', 3),\n",
              " ('<https://schema.org/FastFoodRestaurant>', 10),\n",
              " ('<https://schema.org/Mosque>', 10),\n",
              " ('<https://schema.org/TravelAgency>', 3),\n",
              " ('<https://schema.org/GovernmentOffice>', 11),\n",
              " ('<https://schema.org/ListItem>', 5),\n",
              " ('<https://schema.org/Motel>', 10),\n",
              " ('<https://schema.org/RadioStation>', 9),\n",
              " ('<http://schema.org/FinancialService>', 7),\n",
              " ('<https://schema.org/LodgingBusiness>', 10),\n",
              " ('<https://schema.org/HomeAndConstructionBusiness>', 3),\n",
              " ('<https://schema.org/PetStore>', 3),\n",
              " ('<https://schema.org/Plumber>', 3),\n",
              " ('<http://schema.org/SiteNavigationElement>', 3),\n",
              " ('<https://schema.org/City>', 11),\n",
              " ('<http://schema.org/ElementarySchool>', 8),\n",
              " ('<http://schema.org/ImageGallery>', 6),\n",
              " ('<https://schema.org/AnimalShelter>', 5),\n",
              " ('<http://schema.org/GovernmentBuilding>', 6),\n",
              " ('<http://schema.org/WebSite>', 9),\n",
              " ('<https://schema.org/ApartmentComplex>', 6),\n",
              " ('<http://schema.org/CollectionPage>', 5),\n",
              " ('<http://schema.org/NGO>', 11),\n",
              " ('<http://schema.org/VideoObject>', 7),\n",
              " ('<http://www.w3.org/2003/01/geo/wgs84_pos#SpatialThing>', 50),\n",
              " ('<https://stmartin.suedlicheweinstrasse.de/st-martin/sehenswuerdigkeiten/infosystem/Hochberggipfel-mit-Steinernem-Koeppel_St-Martin/ImageObject>',\n",
              "  1),\n",
              " ('<http://schema.org/Bridge>', 3),\n",
              " ('<https://schema.org/Nursing>', 3),\n",
              " ('<http://dbpedia.org/ontology/Place>', 50),\n",
              " ('<http://schema.org/Event>', 11),\n",
              " ('<http://schema.org/Question>', 3),\n",
              " ('<http://schema.org/FAQPage>', 9)]"
            ]
          },
          "metadata": {},
          "execution_count": 35
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "- QD1 CONSTRUCT { <D> v:propertyPartition [ v:property ?p ] } WHERE { ?s ?p ?o }\n",
        "- QD2 CONSTRUCT { <D> v:propertyPartition [ v:property ?p ; v:triples ?x ] }\n",
        "WHERE { SELECT (COUNT(?o) AS ?x) ?p WHERE { ?s ?p ?o } GROUP BY ?p }\n",
        "- QD3 CONSTRUCT { <D> v:propertyPartition [ v:property ?p ; v:distinctSubjects ?x ] }\n",
        "WHERE { SELECT (COUNT(DISTINCT ?s) AS ?x) ?p WHERE { ?s ?p ?o } GROUP BY ?p }\n",
        "- QD4 CONSTRUCT { <D> v:propertyPartition [ v:property ?p ; v:distinctObjects ?x ] }\n",
        "WHERE { SELECT (COUNT(DISTINCT ?o) AS ?x) ?p WHERE { ?s ?p ?o } GROUP BY ?p }"
      ],
      "metadata": {
        "id": "97ZjTj6Fg-zD"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "Your code ??"
      ],
      "metadata": {
        "id": "89F_wX_1haKB",
        "outputId": "4d8c86b8-5c03-4da3-f288-04aaa5cdbf86",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 132
        }
      },
      "execution_count": 36,
      "outputs": [
        {
          "output_type": "error",
          "ename": "SyntaxError",
          "evalue": "ignored",
          "traceback": [
            "\u001b[0;36m  File \u001b[0;32m\"<ipython-input-36-f2cf96c12fbf>\"\u001b[0;36m, line \u001b[0;32m1\u001b[0m\n\u001b[0;31m    Your code ??\u001b[0m\n\u001b[0m            ^\u001b[0m\n\u001b[0;31mSyntaxError\u001b[0m\u001b[0;31m:\u001b[0m invalid syntax\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "- QE1 CONSTRUCT { <D> v:classPartition [ v:class ?c ; v:propertyPartition [ v:property ?p ] ] }\n",
        "WHERE { ?s a ?c ; ?p ?o }\n",
        "- QE2 CONSTRUCT { <D> v:classPartition [ v:class ?c\n",
        "v:propertyPartition [ v:property ?p ; v:triples ?x ] ] }\n",
        "WHERE { SELECT (COUNT(?o) AS ?x) ?p WHERE { ?s a ?c ; ?p ?o } GROUP BY ?c ?p }\n",
        "- QE3 CONSTRUCT { <D> v:classPartition [ v:class ?c ;\n",
        "v:propertyPartition [ v:distinctSubjects ?x ] ] }\n",
        "WHERE { SELECT (COUNT(DISTINCT ?s) AS ?x) ?c ?p WHERE { ?s a ?c ; ?p ?o } GROUP BY ?c ?p }\n",
        "- QE4 CONSTRUCT { <D> v:classPartition [ v:class ?c ;\n",
        "v:propertyPartition [ v:distinctObjects ?x ; v:property ?p ] ] }\n",
        "WHERE { SELECT (COUNT(DISTINCT ?o) AS ?x) ?c ?p WHERE { ?s a ?c ; ?p ?o } GROUP BY ?c ?p }"
      ],
      "metadata": {
        "id": "mxe3xkJfhNxR"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "Your code"
      ],
      "metadata": {
        "id": "qv8Qjo00hbrv"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "# Same Exercice with PySpark SQL\n",
        "\n"
      ],
      "metadata": {
        "id": "Li1TEohMhx6T"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "from pyspark.sql import Row\n",
        "spo=triples.map(lambda x: Row(subject=x[0],predicate=x[1],object=x[2]))\n",
        "df=spark.createDataFrame(spo)\n",
        "df.createOrReplaceTempView(\"SPO\")\n",
        "df.show()\n",
        "\n"
      ],
      "metadata": {
        "id": "aFnWNjqBh5k2"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "\n",
        "result=spark.sql(\"select subject from SPO\")\n",
        "result.show()"
      ],
      "metadata": {
        "id": "yLIpbyfykQ-Q"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "Write SQL PySpark for the following queries (your can ignore the construct statement, just compute the select part...)\n",
        "\n",
        "QB1 CONSTRUCT { v:triples ?x } WHERE { SELECT (COUNT(*) AS ?x) WHERE { ?s ?p ?o } }\n",
        "\n",
        "QB2 CONSTRUCT { v:classes ?x } WHERE { SELECT (COUNT(DISTINCT ?o) AS ?x) WHERE { ?s a ?o } }\n",
        "\n",
        "QB3 CONSTRUCT { v:properties ?x } WHERE { SELECT (COUNT(DISTINCT ?p) AS ?x) WHERE { ?s ?p ?o } }\n",
        "\n",
        "QB4 CONSTRUCT { v:distinctSubjects ?x } WHERE { SELECT (COUNT(DISTINCT ?s) AS ?x) WHERE { ?s ?p ?o } }\n",
        "\n",
        "QB5 CONSTRUCT { v:distinctObjects ?x } WHERE { SELECT (COUNT(DISTINCT ?o) AS ?x) WHERE { ?s ?p ?o } }"
      ],
      "metadata": {
        "id": "pjK-ux6WnBum"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "Your Code"
      ],
      "metadata": {
        "id": "nXTYMJYCiIuK"
      },
      "execution_count": null,
      "outputs": []
    }
  ]
}